export interface FoodDetails {
  卡路里: number;
  蛋白质?: number; // 可选，允许部分数据缺失
  碳水化合物?: number; // 可选
  脂肪?: number; // 可选，部分数据有脂肪
}

export interface FoodData {
  [category: string]: {
    [foodName: string]: FoodDetails;
  };
}

export const foodData: FoodData = {
    "主食": {
        "优糯米": {
            "卡路里": 345.0,
            "蛋白质": 9.0,
            "碳水化合物": 75.3,
            "脂肪": 1.0
        },
        "油面筋": {
            "卡路里": 493.0,
            "蛋白质": 26.9,
            "碳水化合物": 40.4,
            "脂肪": 25.1
        },
        "芋头": {
            "卡路里": 81.0,
            "蛋白质": 2.2,
            "碳水化合物": 18.1,
            "脂肪": 0.2
        },
        "黑麦面粉（中级）": {
            "卡路里": 349.0,
            "蛋白质": 10.88,
            "碳水化合物": 75.43,
            "脂肪": 1.52
        },
        "藜麦": {
            "卡路里": 368.0,
            "蛋白质": 14.12,
            "碳水化合物": 64.16,
            "脂肪": 6.07
        },
        "薏米面": {
            "卡路里": 351.0,
            "蛋白质": 11.3,
            "碳水化合物": 73.5,
            "脂肪": 2.4
        },
        "藜麦（熟的）": {
            "卡路里": 120.0,
            "蛋白质": 4.4,
            "碳水化合物": 21.3,
            "脂肪": 1.92
        },
        "高粱": {
            "卡路里": 329.0,
            "蛋白质": 10.62,
            "碳水化合物": 72.09,
            "脂肪": 3.46
        },
        "荞麦": {
            "卡路里": 343.0,
            "蛋白质": 13.25,
            "碳水化合物": 71.5,
            "脂肪": 3.4
        },
        "莜麦面": {
            "卡路里": 376.0,
            "蛋白质": 12.2,
            "碳水化合物": 67.8,
            "脂肪": 7.2
        },
        "薏米（薏仁米、苡米）": {
            "卡路里": 361.0,
            "蛋白质": 12.8,
            "碳水化合物": 71.1,
            "脂肪": 3.3
        },
        "荞麦（带皮）": {
            "卡路里": 319.0,
            "蛋白质": 9.5,
            "碳水化合物": 73.0,
            "脂肪": 1.7
        },
        "荞麦片（烘焙）": {
            "卡路里": 346.0,
            "蛋白质": 11.73,
            "碳水化合物": 74.95,
            "脂肪": 2.71
        },
        "燕麦": {
            "卡路里": 389.0,
            "蛋白质": 16.89,
            "碳水化合物": 66.27,
            "脂肪": 6.9
        },
        "燕麦麸皮": {
            "卡路里": 246.0,
            "蛋白质": 17.3,
            "碳水化合物": 66.22,
            "脂肪": 7.03
        },
        "苦荞麦粉": {
            "卡路里": 316.0,
            "蛋白质": 9.7,
            "碳水化合物": 66.0,
            "脂肪": 2.7
        },
        "蒸粗麦粉（熟）": {
            "卡路里": 112.0,
            "蛋白质": 3.79,
            "碳水化合物": 23.22,
            "脂肪": 0.16
        },
        "高粱米": {
            "卡路里": 360.0,
            "蛋白质": 10.4,
            "碳水化合物": 74.7,
            "脂肪": 3.1
        },
        "小米": {
            "卡路里": 378.0,
            "蛋白质": 11.02,
            "碳水化合物": 72.85,
            "脂肪": 4.22
        },
        "荞麦粉（全麦）": {
            "卡路里": 335.0,
            "蛋白质": 12.62,
            "碳水化合物": 70.59,
            "脂肪": 3.1
        },
        "糜子米（炒米）": {
            "卡路里": 376.0,
            "蛋白质": 8.1,
            "碳水化合物": 80.5,
            "脂肪": 2.6
        },
        "小米面": {
            "卡路里": 357.0,
            "蛋白质": 7.2,
            "碳水化合物": 77.7,
            "脂肪": 2.1
        },
        "珍珠大麦（熟）": {
            "卡路里": 123.0,
            "蛋白质": 2.26,
            "碳水化合物": 28.22,
            "脂肪": 0.44
        },
        "黄米": {
            "卡路里": 351.0,
            "蛋白质": 9.7,
            "碳水化合物": 76.9,
            "脂肪": 1.5
        },
        "大黄米": {
            "卡路里": 356.0,
            "蛋白质": 13.6,
            "碳水化合物": 71.1,
            "脂肪": 2.7
        },
        "珍珠大麦": {
            "卡路里": 352.0,
            "蛋白质": 9.91,
            "碳水化合物": 77.72,
            "脂肪": 1.16
        },
        "大麦麦芽粉": {
            "卡路里": 361.0,
            "蛋白质": 10.28,
            "碳水化合物": 78.3,
            "脂肪": 1.84
        },
        "糜子": {
            "卡路里": 336.0,
            "蛋白质": 10.6,
            "碳水化合物": 75.1,
            "脂肪": 0.6
        },
        "麦片": {
            "卡路里": 376.0,
            "蛋白质": 13.2,
            "碳水化合物": 69.4,
            "脂肪": 6.6
        },
        "大麦（去壳）": {
            "卡路里": 354.0,
            "蛋白质": 12.48,
            "碳水化合物": 73.48,
            "脂肪": 2.3
        },
        "大麦面粉": {
            "卡路里": 345.0,
            "蛋白质": 10.5,
            "碳水化合物": 74.52,
            "脂肪": 1.6
        },
        "大麦": {
            "卡路里": 327.0,
            "蛋白质": 10.2,
            "碳水化合物": 73.3,
            "脂肪": 1.4
        },
        "玉米粥（灰蓝玉米）": {
            "卡路里": 54.0,
            "蛋白质": 0.66,
            "碳水化合物": 11.74,
            "脂肪": 0.49
        },
        "玉米面（全谷物）": {
            "卡路里": 362.0,
            "蛋白质": 8.12,
            "碳水化合物": 76.89,
            "脂肪": 3.59
        },
        "青稞": {
            "卡路里": 342.0,
            "蛋白质": 8.1,
            "碳水化合物": 75.0,
            "脂肪": 1.5
        },
        "玉米面粉（全谷物）": {
            "卡路里": 361.0,
            "蛋白质": 6.93,
            "碳水化合物": 76.85,
            "脂肪": 3.86
        },
        "黄玉米": {
            "卡路里": 348.0,
            "蛋白质": 8.7,
            "碳水化合物": 73.0,
            "脂肪": 3.8
        },
        "玉米（甜）": {
            "卡路里": 86.0,
            "蛋白质": 3.27,
            "碳水化合物": 18.7,
            "脂肪": 1.35
        },
        "玉米面（蓝色）": {
            "卡路里": 398.0,
            "蛋白质": 10.4,
            "碳水化合物": 76.93,
            "脂肪": 5.44
        },
        "白玉米面": {
            "卡路里": 353.0,
            "蛋白质": 8.0,
            "碳水化合物": 73.1,
            "脂肪": 4.5
        },
        "黄玉米糁": {
            "卡路里": 354.0,
            "蛋白质": 7.9,
            "碳水化合物": 75.6,
            "脂肪": 3.0
        },
        "糙米粉": {
            "卡路里": 363.0,
            "蛋白质": 7.23,
            "碳水化合物": 76.48,
            "脂肪": 2.78
        },
        "玉米": {
            "卡路里": 112.0,
            "蛋白质": 4.0,
            "碳水化合物": 22.8,
            "脂肪": 1.2
        },
        "白玉米": {
            "卡路里": 352.0,
            "蛋白质": 8.8,
            "碳水化合物": 74.7,
            "脂肪": 3.8
        },
        "野生稻": {
            "卡路里": 357.0,
            "蛋白质": 14.73,
            "碳水化合物": 74.9,
            "脂肪": 1.08
        },
        "大米（长粒、强化）": {
            "卡路里": 365.0,
            "蛋白质": 7.13,
            "碳水化合物": 79.95,
            "脂肪": 0.66
        },
        "米饭（均值）": {
            "卡路里": 116.0,
            "蛋白质": 2.6,
            "碳水化合物": 25.9,
            "脂肪": 0.3
        },
        "玉米粒": {
            "卡路里": 365.0,
            "蛋白质": 9.42,
            "碳水化合物": 74.26,
            "脂肪": 4.74
        },
        "糙米（中粒、熟）": {
            "卡路里": 112.0,
            "蛋白质": 2.32,
            "碳水化合物": 23.51,
            "脂肪": 0.83
        },
        "糙米（中粒）": {
            "卡路里": 362.0,
            "蛋白质": 7.5,
            "碳水化合物": 76.17,
            "脂肪": 2.68
        },
        "籼米粉": {
            "卡路里": 356.0,
            "蛋白质": 7.4,
            "碳水化合物": 81.5,
            "脂肪": 0.1
        },
        "糙米（长粒、熟）": {
            "卡路里": 123.0,
            "蛋白质": 2.74,
            "碳水化合物": 25.58,
            "脂肪": 0.97
        },
        "粳糯米": {
            "卡路里": 344.0,
            "蛋白质": 7.9,
            "碳水化合物": 76.7,
            "脂肪": 0.8
        },
        "紫红糯米": {
            "卡路里": 346.0,
            "蛋白质": 8.3,
            "碳水化合物": 75.1,
            "脂肪": 1.7
        },
        "糙米（长粒）": {
            "卡路里": 367.0,
            "蛋白质": 7.54,
            "碳水化合物": 76.25,
            "脂肪": 3.2
        },
        "籼糯米": {
            "卡路里": 353.0,
            "蛋白质": 7.9,
            "碳水化合物": 78.0,
            "脂肪": 1.1
        },
        "大米": {
            "卡路里": 360.0,
            "蛋白质": 6.61,
            "碳水化合物": 79.34,
            "脂肪": 0.58
        },
        "黄玉米面": {
            "卡路里": 352.0,
            "蛋白质": 8.1,
            "碳水化合物": 75.2,
            "脂肪": 3.3
        },
        "大米（长粒、强化、熟）": {
            "卡路里": 130.0,
            "蛋白质": 2.69,
            "碳水化合物": 28.17,
            "脂肪": 0.28
        },
        "早糯谷": {
            "卡路里": 360.0,
            "蛋白质": 7.1,
            "碳水化合物": 77.0,
            "脂肪": 3.2
        },
        "香米": {
            "卡路里": 347.0,
            "蛋白质": 12.7,
            "碳水化合物": 72.4,
            "脂肪": 0.9
        },
        "糯米": {
            "卡路里": 350.0,
            "蛋白质": 7.3,
            "碳水化合物": 78.3,
            "脂肪": 1.0
        },
        "粳米（特等）": {
            "卡路里": 335.0,
            "蛋白质": 7.3,
            "碳水化合物": 75.7,
            "脂肪": 0.4
        },
        "粳米（标二）": {
            "卡路里": 347.0,
            "蛋白质": 8.0,
            "碳水化合物": 77.7,
            "脂肪": 0.6
        },
        "籼米（优标）": {
            "卡路里": 350.0,
            "蛋白质": 8.3,
            "碳水化合物": 77.3,
            "脂肪": 1.0
        },
        "籼米": {
            "卡路里": 349.0,
            "蛋白质": 7.9,
            "碳水化合物": 78.3,
            "脂肪": 0.6
        },
        "粳米（标三）": {
            "卡路里": 346.0,
            "蛋白质": 7.2,
            "碳水化合物": 77.6,
            "脂肪": 0.8
        },
        "籼米（标一）": {
            "卡路里": 348.0,
            "蛋白质": 7.7,
            "碳水化合物": 77.9,
            "脂肪": 0.7
        },
        "粳米（标四）": {
            "卡路里": 347.0,
            "蛋白质": 7.5,
            "碳水化合物": 78.1,
            "脂肪": 0.7
        },
        "意大利面（全麦、干）": {
            "卡路里": 352.0,
            "蛋白质": 13.87,
            "碳水化合物": 73.37,
            "脂肪": 2.93
        },
        "意大利面（干、强化）": {
            "卡路里": 371.0,
            "蛋白质": 13.04,
            "碳水化合物": 74.67,
            "脂肪": 1.51
        },
        "意大利面（熟、强化）": {
            "卡路里": 158.0,
            "蛋白质": 5.8,
            "碳水化合物": 30.86,
            "脂肪": 0.93
        },
        "百吉饼（鸡蛋）": {
            "卡路里": 278.0,
            "蛋白质": 10.6,
            "碳水化合物": 53.0,
            "脂肪": 2.1
        },
        "百吉饼（肉桂葡萄干）": {
            "卡路里": 274.0,
            "蛋白质": 9.8,
            "碳水化合物": 55.2,
            "脂肪": 1.7
        },
        "黑米": {
            "卡路里": 341.0,
            "蛋白质": 9.4,
            "碳水化合物": 72.2,
            "脂肪": 2.5
        },
        "面条（鸡蛋、干、强化）": {
            "卡路里": 384.0,
            "蛋白质": 14.16,
            "碳水化合物": 71.27,
            "脂肪": 4.44
        },
        "意大利面（新鲜冷藏、菠菜）": {
            "卡路里": 289.0,
            "蛋白质": 11.26,
            "碳水化合物": 55.72,
            "脂肪": 2.1
        },
        "小麦胚芽": {
            "卡路里": 360.0,
            "蛋白质": 23.15,
            "碳水化合物": 51.8,
            "脂肪": 9.72
        },
        "粳米": {
            "卡路里": 345.0,
            "蛋白质": 7.7,
            "碳水化合物": 77.4,
            "脂肪": 0.6
        },
        "面包（白色）": {
            "卡路里": 266.0,
            "蛋白质": 8.85,
            "碳水化合物": 49.42,
            "脂肪": 3.33
        },
        "粗粒小麦粉（强化）": {
            "卡路里": 360.0,
            "蛋白质": 12.68,
            "碳水化合物": 72.83,
            "脂肪": 1.05
        },
        "全麦面粉": {
            "卡路里": 340.0,
            "蛋白质": 13.21,
            "碳水化合物": 71.97,
            "脂肪": 2.5
        },
        "稻米": {
            "卡路里": 347.0,
            "蛋白质": 7.4,
            "碳水化合物": 77.9,
            "脂肪": 0.8
        },
        "面包屑": {
            "卡路里": 395.0,
            "蛋白质": 13.35,
            "碳水化合物": 71.98,
            "脂肪": 5.3
        },
        "全麦面包": {
            "卡路里": 252.0,
            "蛋白质": 12.45,
            "碳水化合物": 42.71,
            "脂肪": 3.5
        },
        "小麦麸皮": {
            "卡路里": 216.0,
            "蛋白质": 15.55,
            "碳水化合物": 64.51,
            "脂肪": 4.25
        },
        "水面筋": {
            "卡路里": 142.0,
            "蛋白质": 23.5,
            "碳水化合物": 12.3,
            "脂肪": 0.1
        },
        "油条": {
            "卡路里": 388.0,
            "蛋白质": 6.9,
            "碳水化合物": 51.0,
            "脂肪": 17.6
        },
        "油饼": {
            "卡路里": 403.0,
            "蛋白质": 7.9,
            "碳水化合物": 42.4,
            "脂肪": 22.9
        },
        "馒头（富强粉）": {
            "卡路里": 210.0,
            "蛋白质": 6.2,
            "碳水化合物": 44.2,
            "脂肪": 1.2
        },
        "挂面": {
            "卡路里": 348.0,
            "蛋白质": 10.1,
            "碳水化合物": 76.0,
            "脂肪": 0.7
        },
        "花卷": {
            "卡路里": 214.0,
            "蛋白质": 6.4,
            "碳水化合物": 45.6,
            "脂肪": 1.0
        },
        "烙饼": {
            "卡路里": 259.0,
            "蛋白质": 7.5,
            "碳水化合物": 52.9,
            "脂肪": 2.3
        },
        "面条（富强粉）": {
            "卡路里": 286.0,
            "蛋白质": 9.3,
            "碳水化合物": 59.9,
            "脂肪": 1.1
        },
        "通心粉": {
            "卡路里": 351.0,
            "蛋白质": 11.9,
            "碳水化合物": 75.8,
            "脂肪": 0.1
        },
        "小麦粉": {
            "卡路里": 349.0,
            "蛋白质": 11.2,
            "碳水化合物": 73.6,
            "脂肪": 1.5
        },
        "馒头": {
            "卡路里": 236.0,
            "蛋白质": 7.8,
            "碳水化合物": 49.8,
            "脂肪": 1.0
        },
        "小麦胚粉": {
            "卡路里": 403.0,
            "蛋白质": 36.4,
            "碳水化合物": 44.5,
            "脂肪": 10.1
        },
        "面条": {
            "卡路里": 283.0,
            "蛋白质": 8.5,
            "碳水化合物": 59.5,
            "脂肪": 1.6
        },
        "小麦粉（特二粉）": {
            "卡路里": 352.0,
            "蛋白质": 10.4,
            "碳水化合物": 75.9,
            "脂肪": 1.1
        },
        "小麦粉（富强粉、特一粉）": {
            "卡路里": 351.0,
            "蛋白质": 10.3,
            "碳水化合物": 75.2,
            "脂肪": 1.1
        },
        "麸皮": {
            "卡路里": 282.0,
            "蛋白质": 15.8,
            "碳水化合物": 61.4,
            "脂肪": 4.0
        },
        "挂面（富强粉）": {
            "卡路里": 347.0,
            "蛋白质": 9.6,
            "碳水化合物": 76.0,
            "脂肪": 0.6
        },
        "小麦": {
            "卡路里": 339.0,
            "蛋白质": 11.9,
            "碳水化合物": 75.2,
            "脂肪": 1.3
        },
        "粉条": {
            "卡路里": 339.0,
            "蛋白质": 0.5,
            "碳水化合物": 84.2,
            "脂肪": 0.1
        },
        "豌豆粉丝": {
            "卡路里": 368.0,
            "蛋白质": 0.4,
            "碳水化合物": 91.7,
            "脂肪": 0
        },
        "马铃薯（熟）": {
            "卡路里": 87.0,
            "蛋白质": 1.87,
            "碳水化合物": 20.13,
            "脂肪": 0.1
        },
        "藕粉": {
            "卡路里": 373.0,
            "蛋白质": 0.2,
            "碳水化合物": 93.0,
            "脂肪": 0
        },
        "红薯（熟）": {
            "卡路里": 90.0,
            "蛋白质": 2.01,
            "碳水化合物": 20.71,
            "脂肪": 0.15
        },
        "蚕豆淀粉": {
            "卡路里": 342.0,
            "蛋白质": 0.5,
            "碳水化合物": 85.3,
            "脂肪": 0
        },
        "豌豆淀粉": {
            "卡路里": 342.0,
            "蛋白质": 0.6,
            "碳水化合物": 85.0,
            "脂肪": 0
        },
        "马铃薯（赤褐色）": {
            "卡路里": 79.0,
            "蛋白质": 2.14,
            "碳水化合物": 18.07,
            "脂肪": 0.08
        },
        "魔芋精粉": {
            "卡路里": 186.0,
            "蛋白质": 4.6,
            "碳水化合物": 78.8,
            "脂肪": 0.1
        },
        "土豆（白色）": {
            "卡路里": 69.0,
            "蛋白质": 1.68,
            "碳水化合物": 15.71,
            "脂肪": 0.1
        },
        "玉米淀粉": {
            "卡路里": 346.0,
            "蛋白质": 1.2,
            "碳水化合物": 85.0,
            "脂肪": 0.1
        },
        "马铃薯（熟、不带皮）": {
            "卡路里": 86.0,
            "蛋白质": 1.71,
            "碳水化合物": 20.01,
            "脂肪": 0.1
        },
        "土豆（白色、烘焙）": {
            "卡路里": 92.0,
            "蛋白质": 2.1,
            "碳水化合物": 21.08,
            "脂肪": 0.15
        },
        "甘薯": {
            "卡路里": 86.0,
            "蛋白质": 1.57,
            "碳水化合物": 20.12,
            "脂肪": 0.05
        },
        "红薯（熟、不带皮）": {
            "卡路里": 76.0,
            "蛋白质": 1.37,
            "碳水化合物": 17.72,
            "脂肪": 0.14
        },
        "土豆（赤褐色、烘焙）": {
            "卡路里": 95.0,
            "蛋白质": 2.63,
            "碳水化合物": 21.44,
            "脂肪": 0.13
        },
        "团粉（芡粉）": {
            "卡路里": 348.0,
            "蛋白质": 1.5,
            "碳水化合物": 85.8,
            "脂肪": 0
        },
        "木薯": {
            "卡路里": 119.0,
            "蛋白质": 2.1,
            "碳水化合物": 27.8,
            "脂肪": 0.3
        },
        "芋头（熟）": {
            "卡路里": 142.0,
            "蛋白质": 0.52,
            "碳水化合物": 34.6,
            "脂肪": 0.11
        },
        "土豆（红色）": {
            "卡路里": 70.0,
            "蛋白质": 1.89,
            "碳水化合物": 15.9,
            "脂肪": 0.14
        },
        "土豆（红色、烘焙）": {
            "卡路里": 87.0,
            "蛋白质": 2.3,
            "碳水化合物": 19.59,
            "脂肪": 0.15
        },
        "地瓜干": {
            "卡路里": 344.0,
            "蛋白质": 4.7,
            "碳水化合物": 80.5,
            "脂肪": 0.8
        },
        "马铃薯": {
            "卡路里": 77.0,
            "蛋白质": 2.05,
            "碳水化合物": 17.49,
            "脂肪": 0.09
        },
        "地瓜（红心）": {
            "卡路里": 102.0,
            "蛋白质": 1.1,
            "碳水化合物": 24.7,
            "脂肪": 0.2
        },
        "土豆": {
            "卡路里": 77.0,
            "蛋白质": 2.0,
            "碳水化合物": 17.2,
            "脂肪": 0.2
        },
        "土豆粉": {
            "卡路里": 340.0,
            "蛋白质": 7.2,
            "碳水化合物": 77.4,
            "脂肪": 0.5
        },
        "地瓜": {
            "卡路里": 106.0,
            "蛋白质": 1.4,
            "碳水化合物": 25.2,
            "脂肪": 0.2
        }
    },
    "蛋肉": {
        "鲱鱼（太平洋）": {
            "卡路里": 195.0,
            "蛋白质": 16.39,
            "碳水化合物": 0,
            "脂肪": 13.88
        },
        "海参（干）": {
            "卡路里": 262.0,
            "蛋白质": 50.2,
            "碳水化合物": 4.5,
            "脂肪": 4.8
        },
        "海参": {
            "卡路里": 78.0,
            "蛋白质": 16.5,
            "碳水化合物": 2.5,
            "脂肪": 0.2
        },
        "田螺": {
            "卡路里": 60.0,
            "蛋白质": 11.0,
            "碳水化合物": 3.6,
            "脂肪": 0.2
        },
        "香海螺": {
            "卡路里": 163.0,
            "蛋白质": 22.7,
            "碳水化合物": 10.1,
            "脂肪": 3.5
        },
        "蛇鲻": {
            "卡路里": 122.0,
            "蛋白质": 20.8,
            "碳水化合物": 0.3,
            "脂肪": 4.2
        },
        "鲟鱼": {
            "卡路里": 105.0,
            "蛋白质": 16.14,
            "碳水化合物": 0,
            "脂肪": 4.04
        },
        "章鱼（八爪鱼）": {
            "卡路里": 135.0,
            "蛋白质": 18.9,
            "碳水化合物": 14.0,
            "脂肪": 0.4
        },
        "乌龟": {
            "卡路里": 89.0,
            "蛋白质": 19.8,
            "碳水化合物": 0,
            "脂肪": 0.5
        },
        "乌贼": {
            "卡路里": 84.0,
            "蛋白质": 17.4,
            "碳水化合物": 0,
            "脂肪": 1.6
        },
        "乌鱼蛋": {
            "卡路里": 66.0,
            "蛋白质": 14.1,
            "碳水化合物": 0,
            "脂肪": 1.1
        },
        "海蜇头": {
            "卡路里": 74.0,
            "蛋白质": 6.0,
            "碳水化合物": 11.8,
            "脂肪": 0.3
        },
        "墨鱼（干）": {
            "卡路里": 287.0,
            "蛋白质": 65.3,
            "碳水化合物": 2.1,
            "脂肪": 1.9
        },
        "鱿鱼": {
            "卡路里": 313.0,
            "蛋白质": 60.0,
            "碳水化合物": 7.8,
            "脂肪": 4.6
        },
        "墨鱼": {
            "卡路里": 83.0,
            "蛋白质": 15.2,
            "碳水化合物": 3.4,
            "脂肪": 0.9
        },
        "鱿鱼（水浸）": {
            "卡路里": 75.0,
            "蛋白质": 17.0,
            "碳水化合物": 0,
            "脂肪": 0.8
        },
        "章鱼": {
            "卡路里": 52.0,
            "蛋白质": 10.6,
            "碳水化合物": 1.4,
            "脂肪": 0.4
        },
        "海蜇皮": {
            "卡路里": 33.0,
            "蛋白质": 3.7,
            "碳水化合物": 3.8,
            "脂肪": 0.3
        },
        "海参（水浸）": {
            "卡路里": 25.0,
            "蛋白质": 6.0,
            "碳水化合物": 0,
            "脂肪": 0.1
        },
        "麋鹿肉（臀肉、熟）": {
            "卡路里": 148.0,
            "蛋白质": 30.56,
            "碳水化合物": 0,
            "脂肪": 2.85
        },
        "麋鹿肉（臀肉）": {
            "卡路里": 98.0,
            "蛋白质": 19.74,
            "碳水化合物": 0,
            "脂肪": 2.1
        },
        "鸭蛋": {
            "卡路里": 180.0,
            "蛋白质": 12.6,
            "碳水化合物": 3.1,
            "脂肪": 13.0
        },
        "松花蛋（鸡蛋）": {
            "卡路里": 178.0,
            "蛋白质": 14.8,
            "碳水化合物": 5.8,
            "脂肪": 10.6
        },
        "牛肉（后腱）": {
            "卡路里": 98.0,
            "蛋白质": 20.1,
            "碳水化合物": 2.2,
            "脂肪": 1.0
        },
        "鸡蛋黄粉": {
            "卡路里": 644.0,
            "蛋白质": 31.6,
            "碳水化合物": 5.3,
            "脂肪": 55.1
        },
        "牛肉（里脊）": {
            "卡路里": 107.0,
            "蛋白质": 22.2,
            "碳水化合物": 2.4,
            "脂肪": 0.9
        },
        "牛肉（后腿）": {
            "卡路里": 106.0,
            "蛋白质": 20.9,
            "碳水化合物": 1.1,
            "脂肪": 2.0
        },
        "牛肉（腑肋）": {
            "卡路里": 123.0,
            "蛋白质": 18.6,
            "碳水化合物": 0,
            "脂肪": 5.4
        },
        "鸡蛋": {
            "卡路里": 143.0,
            "蛋白质": 12.56,
            "碳水化合物": 0.72,
            "脂肪": 9.51
        },
        "鸡蛋粉（全蛋粉）": {
            "卡路里": 545.0,
            "蛋白质": 43.4,
            "碳水化合物": 11.3,
            "脂肪": 36.2
        },
        "牛肉": {
            "卡路里": 125.0,
            "蛋白质": 19.9,
            "碳水化合物": 2.0,
            "脂肪": 4.2
        },
        "牛肉（肩部）": {
            "卡路里": 302.0,
            "蛋白质": 30.12,
            "碳水化合物": 0,
            "脂肪": 19.22
        },
        "牛肉（胸部、腌制）": {
            "卡路里": 198.0,
            "蛋白质": 14.68,
            "碳水化合物": 0.14,
            "脂肪": 14.9
        },
        "蛋黄": {
            "卡路里": 322.0,
            "蛋白质": 15.86,
            "碳水化合物": 3.59,
            "脂肪": 26.54
        },
        "石螺": {
            "卡路里": 90.0,
            "蛋白质": 12.8,
            "碳水化合物": 8.2,
            "脂肪": 0.7
        },
        "螺蛳": {
            "卡路里": 59.0,
            "蛋白质": 7.5,
            "碳水化合物": 6.0,
            "脂肪": 0.6
        },
        "红螺": {
            "卡路里": 119.0,
            "蛋白质": 20.2,
            "碳水化合物": 7.6,
            "脂肪": 0.9
        },
        "秋蛤蜊": {
            "卡路里": 89.0,
            "蛋白质": 15.6,
            "碳水化合物": 5.0,
            "脂肪": 0.7
        },
        "沙蛤蜊": {
            "卡路里": 56.0,
            "蛋白质": 8.9,
            "碳水化合物": 0.8,
            "脂肪": 1.9
        },
        "黄螺（东风螺）": {
            "卡路里": 106.0,
            "蛋白质": 19.8,
            "碳水化合物": 4.5,
            "脂肪": 1.0
        },
        "鲜贝": {
            "卡路里": 77.0,
            "蛋白质": 15.7,
            "碳水化合物": 2.5,
            "脂肪": 0.5
        },
        "扇贝（干）": {
            "卡路里": 264.0,
            "蛋白质": 55.6,
            "碳水化合物": 5.1,
            "脂肪": 2.4
        },
        "贻贝（干）": {
            "卡路里": 355.0,
            "蛋白质": 47.8,
            "碳水化合物": 20.1,
            "脂肪": 9.3
        },
        "贻贝": {
            "卡路里": 80.0,
            "蛋白质": 11.4,
            "碳水化合物": 4.7,
            "脂肪": 1.7
        },
        "蚶子": {
            "卡路里": 71.0,
            "蛋白质": 12.2,
            "碳水化合物": 2.3,
            "脂肪": 1.4
        },
        "扇贝": {
            "卡路里": 60.0,
            "蛋白质": 11.1,
            "碳水化合物": 2.6,
            "脂肪": 0.6
        },
        "泥蚶": {
            "卡路里": 71.0,
            "蛋白质": 10.0,
            "碳水化合物": 6.0,
            "脂肪": 0.8
        },
        "生蚝": {
            "卡路里": 57.0,
            "蛋白质": 10.9,
            "碳水化合物": 0,
            "脂肪": 1.5
        },
        "鲍鱼": {
            "卡路里": 84.0,
            "蛋白质": 12.6,
            "碳水化合物": 6.6,
            "脂肪": 0.8
        },
        "毛蛤蜊": {
            "卡路里": 97.0,
            "蛋白质": 15.0,
            "碳水化合物": 7.1,
            "脂肪": 1.0
        },
        "蛤蜊（均值）": {
            "卡路里": 62.0,
            "蛋白质": 10.1,
            "碳水化合物": 2.8,
            "脂肪": 1.1
        },
        "螺": {
            "卡路里": 100.0,
            "蛋白质": 15.7,
            "碳水化合物": 6.6,
            "脂肪": 1.2
        },
        "蛏干": {
            "卡路里": 340.0,
            "蛋白质": 46.5,
            "碳水化合物": 27.4,
            "脂肪": 4.9
        },
        "花蛤蜊": {
            "卡路里": 45.0,
            "蛋白质": 7.7,
            "碳水化合物": 2.2,
            "脂肪": 0.6
        },
        "蛏子": {
            "卡路里": 40.0,
            "蛋白质": 7.3,
            "碳水化合物": 2.1,
            "脂肪": 0.3
        },
        "鲍鱼（干）": {
            "卡路里": 322.0,
            "蛋白质": 54.1,
            "碳水化合物": 13.7,
            "脂肪": 5.6
        },
        "赤贝": {
            "卡路里": 61.0,
            "蛋白质": 13.9,
            "碳水化合物": 0,
            "脂肪": 0.6
        },
        "河蚌": {
            "卡路里": 54.0,
            "蛋白质": 10.9,
            "碳水化合物": 0.7,
            "脂肪": 0.8
        },
        "锯缘青蟹": {
            "卡路里": 80.0,
            "蛋白质": 14.6,
            "碳水化合物": 1.7,
            "脂肪": 1.6
        },
        "螃蟹（海蟹）": {
            "卡路里": 95.0,
            "蛋白质": 13.8,
            "碳水化合物": 4.7,
            "脂肪": 2.3
        },
        "河蟹": {
            "卡路里": 103.0,
            "蛋白质": 17.5,
            "碳水化合物": 2.3,
            "脂肪": 2.6
        },
        "蟹肉": {
            "卡路里": 62.0,
            "蛋白质": 11.6,
            "碳水化合物": 1.1,
            "脂肪": 1.2
        },
        "虾头酱（虾脑酱）": {
            "卡路里": 100.0,
            "蛋白质": 15.2,
            "碳水化合物": 0,
            "脂肪": 4.3
        },
        "龙虾": {
            "卡路里": 90.0,
            "蛋白质": 18.9,
            "碳水化合物": 1.0,
            "脂肪": 1.1
        },
        "螯虾": {
            "卡路里": 93.0,
            "蛋白质": 14.8,
            "碳水化合物": 0,
            "脂肪": 3.8
        },
        "明虾": {
            "卡路里": 85.0,
            "蛋白质": 13.4,
            "碳水化合物": 3.8,
            "脂肪": 1.8
        },
        "对虾": {
            "卡路里": 93.0,
            "蛋白质": 18.6,
            "碳水化合物": 2.8,
            "脂肪": 0.8
        },
        "梭子蟹": {
            "卡路里": 95.0,
            "蛋白质": 15.9,
            "碳水化合物": 0.9,
            "脂肪": 3.1
        },
        "沼虾": {
            "卡路里": 87.0,
            "蛋白质": 10.3,
            "碳水化合物": 9.3,
            "脂肪": 0.9
        },
        "中国对虾（东方对虾）": {
            "卡路里": 84.0,
            "蛋白质": 18.3,
            "碳水化合物": 1.6,
            "脂肪": 0.5
        },
        "虾皮": {
            "卡路里": 153.0,
            "蛋白质": 30.7,
            "碳水化合物": 2.5,
            "脂肪": 2.2
        },
        "河虾": {
            "卡路里": 87.0,
            "蛋白质": 16.4,
            "碳水化合物": 0,
            "脂肪": 2.4
        },
        "牡蛎（海蛎子）": {
            "卡路里": 73.0,
            "蛋白质": 5.3,
            "碳水化合物": 8.2,
            "脂肪": 2.1
        },
        "皮皮虾（虾虎、虾蛄）": {
            "卡路里": 81.0,
            "蛋白质": 11.6,
            "碳水化合物": 4.8,
            "脂肪": 1.7
        },
        "刺蛄": {
            "卡路里": 77.0,
            "蛋白质": 16.0,
            "碳水化合物": 0,
            "脂肪": 1.4
        },
        "大虾": {
            "卡路里": 90.0,
            "蛋白质": 18.5,
            "碳水化合物": 3.0,
            "脂肪": 0.4
        },
        "河蚬（蚬子）": {
            "卡路里": 47.0,
            "蛋白质": 7.0,
            "碳水化合物": 1.7,
            "脂肪": 1.4
        },
        "草虾": {
            "卡路里": 103.0,
            "蛋白质": 18.6,
            "碳水化合物": 5.4,
            "脂肪": 0.8
        },
        "白米虾": {
            "卡路里": 81.0,
            "蛋白质": 17.3,
            "碳水化合物": 2.0,
            "脂肪": 0.4
        },
        "钳鱼（熟、油炸）": {
            "卡路里": 229.0,
            "蛋白质": 18.09,
            "碳水化合物": 8.04,
            "脂肪": 13.33
        },
        "钳鱼（养殖、熟）": {
            "卡路里": 144.0,
            "蛋白质": 18.44,
            "碳水化合物": 0,
            "脂肪": 7.19
        },
        "钳鱼（熟）": {
            "卡路里": 105.0,
            "蛋白质": 18.47,
            "碳水化合物": 0,
            "脂肪": 2.85
        },
        "钳鱼（养殖）": {
            "卡路里": 119.0,
            "蛋白质": 15.23,
            "碳水化合物": 0,
            "脂肪": 5.94
        },
        "鲷鱼（熟）": {
            "卡路里": 128.0,
            "蛋白质": 26.3,
            "碳水化合物": 0,
            "脂肪": 1.72
        },
        "多宝鱼（熟）": {
            "卡路里": 122.0,
            "蛋白质": 20.58,
            "碳水化合物": 0,
            "脂肪": 3.78
        },
        "石斑鱼（熟）": {
            "卡路里": 118.0,
            "蛋白质": 24.84,
            "碳水化合物": 0,
            "脂肪": 1.3
        },
        "海米（虾米）": {
            "卡路里": 198.0,
            "蛋白质": 43.7,
            "碳水化合物": 0,
            "脂肪": 2.6
        },
        "基围虾": {
            "卡路里": 101.0,
            "蛋白质": 18.2,
            "碳水化合物": 3.9,
            "脂肪": 1.4
        },
        "钳鱼": {
            "卡路里": 95.0,
            "蛋白质": 16.38,
            "碳水化合物": 0,
            "脂肪": 2.82
        },
        "石斑鱼": {
            "卡路里": 92.0,
            "蛋白质": 19.38,
            "碳水化合物": 0,
            "脂肪": 1.02
        },
        "鲷鱼": {
            "卡路里": 100.0,
            "蛋白质": 20.51,
            "碳水化合物": 0,
            "脂肪": 1.34
        },
        "多宝鱼": {
            "卡路里": 95.0,
            "蛋白质": 16.05,
            "碳水化合物": 0,
            "脂肪": 2.95
        },
        "鲟鱼（熟、干热）": {
            "卡路里": 135.0,
            "蛋白质": 20.7,
            "碳水化合物": 0,
            "脂肪": 5.18
        },
        "塘水虾": {
            "卡路里": 96.0,
            "蛋白质": 21.2,
            "碳水化合物": 0,
            "脂肪": 1.2
        },
        "鲱鱼（大西洋、腌制）": {
            "卡路里": 262.0,
            "蛋白质": 14.19,
            "碳水化合物": 9.64,
            "脂肪": 18.0
        },
        "三文鱼（大西洋）": {
            "卡路里": 142.0,
            "蛋白质": 19.84,
            "碳水化合物": 0,
            "脂肪": 6.34
        },
        "鲱鱼（大西洋）": {
            "卡路里": 158.0,
            "蛋白质": 17.96,
            "碳水化合物": 0,
            "脂肪": 9.04
        },
        "龙利鱼（熟）": {
            "卡路里": 86.0,
            "蛋白质": 15.24,
            "碳水化合物": 0,
            "脂肪": 2.37
        },
        "龙利鱼": {
            "卡路里": 70.0,
            "蛋白质": 12.41,
            "碳水化合物": 0,
            "脂肪": 1.93
        },
        "金枪鱼（淡）": {
            "卡路里": 116.0,
            "蛋白质": 25.51,
            "碳水化合物": 0,
            "脂肪": 0.82
        },
        "金枪鱼（白色、罐装）": {
            "卡路里": 186.0,
            "蛋白质": 26.53,
            "碳水化合物": 0,
            "脂肪": 8.08
        },
        "鲱鱼（大西洋、熏制）": {
            "卡路里": 217.0,
            "蛋白质": 24.58,
            "碳水化合物": 0,
            "脂肪": 12.37
        },
        "鱼露": {
            "卡路里": 47.0,
            "蛋白质": 11.2,
            "碳水化合物": 0,
            "脂肪": 0.2
        },
        "阿拉斯加帝王蟹（模拟蟹肉）": {
            "卡路里": 95.0,
            "蛋白质": 7.62,
            "碳水化合物": 15.0,
            "脂肪": 0.46
        },
        "鲻鱼": {
            "卡路里": 119.0,
            "蛋白质": 18.9,
            "碳水化合物": 0,
            "脂肪": 4.8
        },
        "鮸鱼（鳘鱼）": {
            "卡路里": 89.0,
            "蛋白质": 20.2,
            "碳水化合物": 0,
            "脂肪": 0.9
        },
        "鱼片干": {
            "卡路里": 303.0,
            "蛋白质": 46.1,
            "碳水化合物": 22.0,
            "脂肪": 3.4
        },
        "鳓鱼": {
            "卡路里": 159.0,
            "蛋白质": 20.7,
            "碳水化合物": 0,
            "脂肪": 8.5
        },
        "鲷（黑鲷）": {
            "卡路里": 106.0,
            "蛋白质": 17.9,
            "碳水化合物": 2.7,
            "脂肪": 2.6
        },
        "海虾": {
            "卡路里": 79.0,
            "蛋白质": 16.8,
            "碳水化合物": 1.5,
            "脂肪": 0.6
        },
        "鲚鱼（小）": {
            "卡路里": 124.0,
            "蛋白质": 15.5,
            "碳水化合物": 4.0,
            "脂肪": 5.1
        },
        "鳐鱼": {
            "卡路里": 90.0,
            "蛋白质": 20.8,
            "碳水化合物": 0,
            "脂肪": 0.7
        },
        "鲚鱼（大）": {
            "卡路里": 106.0,
            "蛋白质": 13.2,
            "碳水化合物": 0.8,
            "脂肪": 5.5
        },
        "鳕鱼": {
            "卡路里": 88.0,
            "蛋白质": 20.4,
            "碳水化合物": 0.5,
            "脂肪": 0.5
        },
        "鲑鱼子酱": {
            "卡路里": 252.0,
            "蛋白质": 10.9,
            "碳水化合物": 14.4,
            "脂肪": 16.8
        },
        "鲈鱼（鲈花）": {
            "卡路里": 105.0,
            "蛋白质": 18.6,
            "碳水化合物": 0,
            "脂肪": 3.4
        },
        "鲐鱼（青鲐鱼）": {
            "卡路里": 155.0,
            "蛋白质": 19.9,
            "碳水化合物": 2.2,
            "脂肪": 7.4
        },
        "鲅鱼（马鲛鱼）": {
            "卡路里": 121.0,
            "蛋白质": 21.2,
            "碳水化合物": 2.1,
            "脂肪": 3.1
        },
        "比目鱼": {
            "卡路里": 107.0,
            "蛋白质": 21.1,
            "碳水化合物": 0.5,
            "脂肪": 2.3
        },
        "鲳鱼": {
            "卡路里": 140.0,
            "蛋白质": 18.5,
            "碳水化合物": 0,
            "脂肪": 7.3
        },
        "鲑鱼（大马哈鱼）": {
            "卡路里": 139.0,
            "蛋白质": 17.2,
            "碳水化合物": 0,
            "脂肪": 7.8
        },
        "鲆（比目鱼、偏口鱼）": {
            "卡路里": 112.0,
            "蛋白质": 20.8,
            "碳水化合物": 0,
            "脂肪": 3.2
        },
        "颚针鱼（针量鱼）": {
            "卡路里": 180.0,
            "蛋白质": 20.2,
            "碳水化合物": 1.4,
            "脂肪": 10.4
        },
        "鲨鱼": {
            "卡路里": 118.0,
            "蛋白质": 22.2,
            "碳水化合物": 0,
            "脂肪": 3.2
        },
        "香梭鱼": {
            "卡路里": 145.0,
            "蛋白质": 15.9,
            "碳水化合物": 0,
            "脂肪": 9.0
        },
        "沙钻鱼": {
            "卡路里": 84.0,
            "蛋白质": 18.4,
            "碳水化合物": 1.2,
            "脂肪": 0.6
        },
        "舌鳎（舌头鱼）": {
            "卡路里": 83.0,
            "蛋白质": 17.7,
            "碳水化合物": 0,
            "脂肪": 1.4
        },
        "梅童鱼": {
            "卡路里": 121.0,
            "蛋白质": 18.9,
            "碳水化合物": 0,
            "脂肪": 5.0
        },
        "黄花鱼（大黄花鱼）": {
            "卡路里": 97.0,
            "蛋白质": 17.7,
            "碳水化合物": 0.8,
            "脂肪": 2.5
        },
        "金线鱼（红三鱼）": {
            "卡路里": 101.0,
            "蛋白质": 18.6,
            "碳水化合物": 0,
            "脂肪": 2.9
        },
        "老板鱼": {
            "卡路里": 81.0,
            "蛋白质": 18.5,
            "碳水化合物": 0.6,
            "脂肪": 0.5
        },
        "面包鱼": {
            "卡路里": 83.0,
            "蛋白质": 18.1,
            "碳水化合物": 1.2,
            "脂肪": 0.6
        },
        "黄花鱼（小黄花鱼）": {
            "卡路里": 99.0,
            "蛋白质": 17.9,
            "碳水化合物": 0.1,
            "脂肪": 3.0
        },
        "沙丁鱼": {
            "卡路里": 89.0,
            "蛋白质": 19.8,
            "碳水化合物": 0,
            "脂肪": 1.1
        },
        "黄姑鱼": {
            "卡路里": 137.0,
            "蛋白质": 18.4,
            "碳水化合物": 0,
            "脂肪": 7.0
        },
        "丁香鱼": {
            "卡路里": 196.0,
            "蛋白质": 37.5,
            "碳水化合物": 4.6,
            "脂肪": 3.1
        },
        "红娘鱼": {
            "卡路里": 105.0,
            "蛋白质": 18.0,
            "碳水化合物": 1.9,
            "脂肪": 2.8
        },
        "带鱼": {
            "卡路里": 127.0,
            "蛋白质": 17.7,
            "碳水化合物": 3.1,
            "脂肪": 4.9
        },
        "鲹鱼（蓝圆鲹）": {
            "卡路里": 124.0,
            "蛋白质": 18.5,
            "碳水化合物": 4.8,
            "脂肪": 3.4
        },
        "海鲫鱼": {
            "卡路里": 206.0,
            "蛋白质": 17.0,
            "碳水化合物": 3.6,
            "脂肪": 13.7
        },
        "海鳗": {
            "卡路里": 122.0,
            "蛋白质": 18.8,
            "碳水化合物": 0.5,
            "脂肪": 5.0
        },
        "狗母鱼（大头狗母鱼）": {
            "卡路里": 100.0,
            "蛋白质": 16.7,
            "碳水化合物": 3.0,
            "脂肪": 2.3
        },
        "堤鱼": {
            "卡路里": 191.0,
            "蛋白质": 17.6,
            "碳水化合物": 1.3,
            "脂肪": 12.8
        },
        "鳟鱼（虹鳟）": {
            "卡路里": 99.0,
            "蛋白质": 18.6,
            "碳水化合物": 0.2,
            "脂肪": 2.6
        },
        "鳜鱼（桂鱼）": {
            "卡路里": 117.0,
            "蛋白质": 19.9,
            "碳水化合物": 0,
            "脂肪": 4.2
        },
        "鳙鱼（胖头鱼）": {
            "卡路里": 100.0,
            "蛋白质": 15.3,
            "碳水化合物": 4.7,
            "脂肪": 2.2
        },
        "鳗鲡（鳗鱼）": {
            "卡路里": 181.0,
            "蛋白质": 18.6,
            "碳水化合物": 2.3,
            "脂肪": 10.8
        },
        "白姑鱼": {
            "卡路里": 150.0,
            "蛋白质": 19.1,
            "碳水化合物": 0,
            "脂肪": 8.2
        },
        "鲮鱼": {
            "卡路里": 95.0,
            "蛋白质": 18.4,
            "碳水化合物": 0.7,
            "脂肪": 2.1
        },
        "鲫鱼": {
            "卡路里": 108.0,
            "蛋白质": 17.1,
            "碳水化合物": 3.8,
            "脂肪": 2.7
        },
        "鳊鱼（武昌鱼）": {
            "卡路里": 135.0,
            "蛋白质": 18.3,
            "碳水化合物": 1.2,
            "脂肪": 6.3
        },
        "白鲢（鲢鱼）": {
            "卡路里": 104.0,
            "蛋白质": 17.8,
            "碳水化合物": 0,
            "脂肪": 3.6
        },
        "鲒花": {
            "卡路里": 117.0,
            "蛋白质": 15.6,
            "碳水化合物": 0,
            "脂肪": 6.1
        },
        "鲇鱼": {
            "卡路里": 103.0,
            "蛋白质": 17.3,
            "碳水化合物": 0,
            "脂肪": 3.7
        },
        "乌鳢（黑鱼）": {
            "卡路里": 85.0,
            "蛋白质": 18.5,
            "碳水化合物": 0,
            "脂肪": 1.2
        },
        "湟鱼": {
            "卡路里": 124.0,
            "蛋白质": 17.1,
            "碳水化合物": 6.7,
            "脂肪": 3.2
        },
        "青鱼": {
            "卡路里": 118.0,
            "蛋白质": 20.1,
            "碳水化合物": 0,
            "脂肪": 4.2
        },
        "银鱼（面条鱼）": {
            "卡路里": 105.0,
            "蛋白质": 17.2,
            "碳水化合物": 0,
            "脂肪": 4.0
        },
        "黄颡鱼": {
            "卡路里": 124.0,
            "蛋白质": 17.8,
            "碳水化合物": 7.1,
            "脂肪": 2.7
        },
        "黄鳝": {
            "卡路里": 89.0,
            "蛋白质": 18.0,
            "碳水化合物": 1.2,
            "脂肪": 1.4
        },
        "尖嘴白": {
            "卡路里": 137.0,
            "蛋白质": 22.7,
            "碳水化合物": 4.1,
            "脂肪": 3.3
        },
        "草鱼": {
            "卡路里": 113.0,
            "蛋白质": 16.6,
            "碳水化合物": 0,
            "脂肪": 5.2
        },
        "塘虱鱼（胡子鲇）": {
            "卡路里": 146.0,
            "蛋白质": 15.4,
            "碳水化合物": 3.1,
            "脂肪": 8.0
        },
        "罗非鱼": {
            "卡路里": 98.0,
            "蛋白质": 18.4,
            "碳水化合物": 2.8,
            "脂肪": 1.5
        },
        "泥鳅": {
            "卡路里": 96.0,
            "蛋白质": 17.9,
            "碳水化合物": 1.7,
            "脂肪": 2.0
        },
        "口头鱼": {
            "卡路里": 134.0,
            "蛋白质": 19.6,
            "碳水化合物": 4.5,
            "脂肪": 4.2
        },
        "鳡鱼": {
            "卡路里": 114.0,
            "蛋白质": 17.5,
            "碳水化合物": 1.2,
            "脂肪": 4.3
        },
        "鲤鱼": {
            "卡路里": 109.0,
            "蛋白质": 17.6,
            "碳水化合物": 0.5,
            "脂肪": 4.1
        },
        "赤眼鳟": {
            "卡路里": 109.0,
            "蛋白质": 18.1,
            "碳水化合物": 0,
            "脂肪": 4.1
        }
    },
    "豆类": {
        "豇豆（黑眼）": {
            "卡路里": 90.0,
            "蛋白质": 2.95,
            "碳水化合物": 18.83,
            "脂肪": 0.35
        },
        "蚕豆": {
            "卡路里": 72.0,
            "蛋白质": 5.6,
            "碳水化合物": 11.7,
            "脂肪": 0.6
        },
        "豌豆": {
            "卡路里": 111.0,
            "蛋白质": 7.4,
            "碳水化合物": 21.2,
            "脂肪": 0.3
        },
        "扁豆": {
            "卡路里": 41.0,
            "蛋白质": 2.7,
            "碳水化合物": 8.2,
            "脂肪": 0.2
        },
        "豇豆": {
            "卡路里": 33.0,
            "蛋白质": 2.9,
            "碳水化合物": 5.9,
            "脂肪": 0.3
        },
        "芸豆": {
            "卡路里": 30.0,
            "蛋白质": 0.8,
            "碳水化合物": 7.4,
            "脂肪": 0.1
        },
        "蔓越莓（熟）": {
            "卡路里": 136.0,
            "蛋白质": 9.34,
            "碳水化合物": 24.46,
            "脂肪": 0.46
        },
        "蔓越莓（罐头）": {
            "卡路里": 83.0,
            "蛋白质": 5.54,
            "碳水化合物": 15.12,
            "脂肪": 0.28
        },
        "鸽子豌豆（红色鹰嘴豆）": {
            "卡路里": 343.0,
            "蛋白质": 21.7,
            "碳水化合物": 62.78,
            "脂肪": 1.49
        },
        "羽扇豆": {
            "卡路里": 371.0,
            "蛋白质": 36.17,
            "碳水化合物": 40.37,
            "脂肪": 9.74
        },
        "豌豆（熟）": {
            "卡路里": 118.0,
            "蛋白质": 8.34,
            "碳水化合物": 21.1,
            "脂肪": 0.39
        },
        "葛根": {
            "卡路里": 65.0,
            "蛋白质": 4.24,
            "碳水化合物": 13.39,
            "脂肪": 0.2
        },
        "利马豆（大、熟）": {
            "卡路里": 115.0,
            "蛋白质": 7.8,
            "碳水化合物": 20.88,
            "脂肪": 0.38
        },
        "鹰嘴豆（熟）": {
            "卡路里": 164.0,
            "蛋白质": 8.86,
            "碳水化合物": 27.42,
            "脂肪": 2.59
        },
        "法兰克福（素食）": {
            "卡路里": 233.0,
            "蛋白质": 19.61,
            "碳水化合物": 7.7,
            "脂肪": 13.73
        },
        "豌豆（绿色）": {
            "卡路里": 364.0,
            "蛋白质": 23.12,
            "碳水化合物": 61.63,
            "脂肪": 3.89
        },
        "蔓越莓": {
            "卡路里": 335.0,
            "蛋白质": 23.03,
            "碳水化合物": 60.05,
            "脂肪": 1.23
        },
        "花豆（熟）": {
            "卡路里": 143.0,
            "蛋白质": 9.01,
            "碳水化合物": 26.22,
            "脂肪": 0.65
        },
        "豆类（藏青色）": {
            "卡路里": 337.0,
            "蛋白质": 22.33,
            "碳水化合物": 60.75,
            "脂肪": 1.5
        },
        "花豆": {
            "卡路里": 347.0,
            "蛋白质": 21.42,
            "碳水化合物": 62.55,
            "脂肪": 1.23
        },
        "角豆粉": {
            "卡路里": 222.0,
            "蛋白质": 4.62,
            "碳水化合物": 88.88,
            "脂肪": 0.65
        },
        "葛根粉": {
            "卡路里": 357.0,
            "蛋白质": 0.3,
            "碳水化合物": 88.15,
            "脂肪": 0.1
        },
        "鹰嘴豆": {
            "卡路里": 378.0,
            "蛋白质": 20.47,
            "碳水化合物": 62.95,
            "脂肪": 6.04
        },
        "豇豆（熟）": {
            "卡路里": 47.0,
            "蛋白质": 2.53,
            "碳水化合物": 9.18,
            "脂肪": 0.1
        },
        "豌豆（花）": {
            "卡路里": 336.0,
            "蛋白质": 21.6,
            "碳水化合物": 63.6,
            "脂肪": 1.0
        },
        "豌豆（罐装）": {
            "卡路里": 68.0,
            "蛋白质": 4.47,
            "碳水化合物": 11.36,
            "脂肪": 0.8
        },
        "豌豆（冷冻）": {
            "卡路里": 77.0,
            "蛋白质": 5.22,
            "碳水化合物": 13.62,
            "脂肪": 0.4
        },
        "豌豆（冷冻、熟）": {
            "卡路里": 78.0,
            "蛋白质": 5.15,
            "碳水化合物": 14.26,
            "脂肪": 0.27
        },
        "扁豆（白）": {
            "卡路里": 283.0,
            "蛋白质": 19.0,
            "碳水化合物": 55.6,
            "脂肪": 1.3
        },
        "豇豆（紫）": {
            "卡路里": 329.0,
            "蛋白质": 18.9,
            "碳水化合物": 65.8,
            "脂肪": 0.4
        },
        "蚕豆（炸）": {
            "卡路里": 447.0,
            "蛋白质": 26.7,
            "碳水化合物": 40.4,
            "脂肪": 20.0
        },
        "眉豆（饭豇豆）": {
            "卡路里": 334.0,
            "蛋白质": 18.6,
            "碳水化合物": 65.6,
            "脂肪": 1.1
        },
        "马牙大豆": {
            "卡路里": 338.0,
            "蛋白质": 27.2,
            "碳水化合物": 59.4,
            "脂肪": 0.9
        },
        "脑豆": {
            "卡路里": 363.0,
            "蛋白质": 23.4,
            "碳水化合物": 59.6,
            "脂肪": 3.8
        },
        "加州红芸豆（熟）": {
            "卡路里": 124.0,
            "蛋白质": 9.13,
            "碳水化合物": 22.41,
            "脂肪": 0.09
        },
        "芸豆（虎皮）": {
            "卡路里": 341.0,
            "蛋白质": 22.5,
            "碳水化合物": 62.5,
            "脂肪": 0.9
        },
        "蚕豆（烤）": {
            "卡路里": 377.0,
            "蛋白质": 27.0,
            "碳水化合物": 63.8,
            "脂肪": 2.0
        },
        "芸豆（红色）": {
            "卡路里": 337.0,
            "蛋白质": 22.53,
            "碳水化合物": 61.29,
            "脂肪": 1.06
        },
        "芸豆（红）": {
            "卡路里": 331.0,
            "蛋白质": 21.4,
            "碳水化合物": 62.5,
            "脂肪": 1.3
        },
        "芸豆（红色、熟）": {
            "卡路里": 127.0,
            "蛋白质": 8.67,
            "碳水化合物": 22.8,
            "脂肪": 0.5
        },
        "芸豆（杂色）": {
            "卡路里": 327.0,
            "蛋白质": 22.4,
            "碳水化合物": 63.3,
            "脂肪": 0.6
        },
        "芸豆（熟）": {
            "卡路里": 127.0,
            "蛋白质": 8.67,
            "碳水化合物": 22.8,
            "脂肪": 0.5
        },
        "芸豆（罐头）": {
            "卡路里": 84.0,
            "蛋白质": 5.22,
            "碳水化合物": 14.5,
            "脂肪": 0.6
        },
        "赤豆": {
            "卡路里": 128.0,
            "蛋白质": 7.52,
            "碳水化合物": 24.77,
            "脂肪": 0.1
        },
        "蚕豆（去皮）": {
            "卡路里": 347.0,
            "蛋白质": 25.4,
            "碳水化合物": 58.9,
            "脂肪": 1.6
        },
        "蚕豆（罐头）": {
            "卡路里": 71.0,
            "蛋白质": 5.47,
            "碳水化合物": 12.41,
            "脂肪": 0.22
        },
        "花豆（紫）": {
            "卡路里": 330.0,
            "蛋白质": 17.2,
            "碳水化合物": 65.8,
            "脂肪": 1.4
        },
        "豆沙": {
            "卡路里": 247.0,
            "蛋白质": 5.5,
            "碳水化合物": 52.7,
            "脂肪": 1.9
        },
        "红豆粥": {
            "卡路里": 62.0,
            "蛋白质": 1.2,
            "碳水化合物": 13.7,
            "脂肪": 0.4
        },
        "赤小豆（红小豆）": {
            "卡路里": 324.0,
            "蛋白质": 20.2,
            "碳水化合物": 63.4,
            "脂肪": 0.6
        },
        "赤豆（罐装）": {
            "卡路里": 237.0,
            "蛋白质": 3.8,
            "碳水化合物": 55.01,
            "脂肪": 0.03
        },
        "赤豆（熟）": {
            "卡路里": 128.0,
            "蛋白质": 7.52,
            "碳水化合物": 24.77,
            "脂肪": 0.1
        },
        "黑龟豆（熟）": {
            "卡路里": 130.0,
            "蛋白质": 8.18,
            "碳水化合物": 24.35,
            "脂肪": 0.35
        },
        "绿豆": {
            "卡路里": 329.0,
            "蛋白质": 21.6,
            "碳水化合物": 62.0,
            "脂肪": 0.8
        },
        "黑龟豆（罐头）": {
            "卡路里": 91.0,
            "蛋白质": 6.03,
            "碳水化合物": 16.55,
            "脂肪": 0.29
        },
        "素食汉堡": {
            "卡路里": 177.0,
            "蛋白质": 15.7,
            "碳水化合物": 14.27,
            "脂肪": 6.3
        },
        "豆腐": {
            "卡路里": 76.0,
            "蛋白质": 8.08,
            "碳水化合物": 1.87,
            "脂肪": 4.78
        },
        "豆腐（软）": {
            "卡路里": 61.0,
            "蛋白质": 7.17,
            "碳水化合物": 1.18,
            "脂肪": 3.69
        },
        "黑龟豆": {
            "卡路里": 339.0,
            "蛋白质": 21.25,
            "碳水化合物": 63.25,
            "脂肪": 0.9
        },
        "黑豆（熟）": {
            "卡路里": 132.0,
            "蛋白质": 8.86,
            "碳水化合物": 23.71,
            "脂肪": 0.54
        },
        "黑豆（罐头）": {
            "卡路里": 91.0,
            "蛋白质": 6.03,
            "碳水化合物": 16.55,
            "脂肪": 0.29
        },
        "豆腐（油炸）": {
            "卡路里": 270.0,
            "蛋白质": 18.82,
            "碳水化合物": 8.86,
            "脂肪": 20.18
        },
        "豆渣": {
            "卡路里": 76.0,
            "蛋白质": 3.52,
            "碳水化合物": 12.23,
            "脂肪": 1.73
        },
        "豆腐（干冻）": {
            "卡路里": 477.0,
            "蛋白质": 52.47,
            "碳水化合物": 10.03,
            "脂肪": 30.34
        },
        "豆豉（熟）": {
            "卡路里": 195.0,
            "蛋白质": 19.91,
            "碳水化合物": 7.62,
            "脂肪": 11.38
        },
        "豆腐酸奶": {
            "卡路里": 94.0,
            "蛋白质": 3.5,
            "碳水化合物": 15.96,
            "脂肪": 1.8
        },
        "豆腐（MORI-NU）": {
            "卡路里": 62.0,
            "蛋白质": 6.9,
            "碳水化合物": 2.4,
            "脂肪": 2.7
        },
        "豆浆（脱脂、加钙、维生素A和D）": {
            "卡路里": 28.0,
            "蛋白质": 2.47,
            "碳水化合物": 4.14,
            "脂肪": 0.04
        },
        "豆豉": {
            "卡路里": 192.0,
            "蛋白质": 20.29,
            "碳水化合物": 7.64,
            "脂肪": 10.8
        },
        "豆浆（巧克力、加钙、维生素A和D）": {
            "卡路里": 63.0,
            "蛋白质": 2.26,
            "碳水化合物": 9.95,
            "脂肪": 1.53
        },
        "豆浆（低脂、加钙、维生素A和D）": {
            "卡路里": 43.0,
            "蛋白质": 1.65,
            "碳水化合物": 7.2,
            "脂肪": 0.62
        },
        "大豆（干烤）": {
            "卡路里": 449.0,
            "蛋白质": 43.32,
            "碳水化合物": 28.98,
            "脂肪": 21.62
        },
        "绿豆饼": {
            "卡路里": 122.0,
            "蛋白质": 15.2,
            "碳水化合物": 12.7,
            "脂肪": 1.2
        },
        "绿豆（熟）": {
            "卡路里": 105.0,
            "蛋白质": 7.02,
            "碳水化合物": 19.15,
            "脂肪": 0.38
        },
        "豆腐（硬）": {
            "卡路里": 83.0,
            "蛋白质": 9.98,
            "碳水化合物": 1.18,
            "脂肪": 5.26
        },
        "绿豆面": {
            "卡路里": 341.0,
            "蛋白质": 20.8,
            "碳水化合物": 65.8,
            "脂肪": 0.7
        },
        "豆粕": {
            "卡路里": 337.0,
            "蛋白质": 49.2,
            "碳水化合物": 35.89,
            "脂肪": 2.39
        },
        "大豆粉": {
            "卡路里": 434.0,
            "蛋白质": 37.81,
            "碳水化合物": 31.92,
            "脂肪": 20.65
        },
        "大豆分离蛋白": {
            "卡路里": 335.0,
            "蛋白质": 88.32,
            "碳水化合物": 0,
            "脂肪": 3.39
        },
        "大豆浓缩蛋白": {
            "卡路里": 328.0,
            "蛋白质": 63.63,
            "碳水化合物": 25.41,
            "脂肪": 0.46
        },
        "豆类（小白）": {
            "卡路里": 336.0,
            "蛋白质": 21.11,
            "碳水化合物": 62.25,
            "脂肪": 1.18
        },
        "黄豆": {
            "卡路里": 345.0,
            "蛋白质": 22.0,
            "碳水化合物": 60.7,
            "脂肪": 2.6
        },
        "大豆": {
            "卡路里": 446.0,
            "蛋白质": 36.49,
            "碳水化合物": 30.16,
            "脂肪": 19.94
        },
        "大豆（熟）": {
            "卡路里": 172.0,
            "蛋白质": 18.21,
            "碳水化合物": 8.36,
            "脂肪": 8.97
        },
        "大豆（白色）": {
            "卡路里": 333.0,
            "蛋白质": 23.36,
            "碳水化合物": 60.27,
            "脂肪": 0.85
        },
        "豆类（白色、熟）": {
            "卡路里": 139.0,
            "蛋白质": 9.73,
            "碳水化合物": 25.09,
            "脂肪": 0.35
        },
        "素鸡": {
            "卡路里": 194.0,
            "蛋白质": 16.5,
            "碳水化合物": 4.2,
            "脂肪": 12.5
        },
        "大豆（绿色）": {
            "卡路里": 147.0,
            "蛋白质": 12.95,
            "碳水化合物": 11.05,
            "脂肪": 6.8
        },
        "素大肠": {
            "卡路里": 155.0,
            "蛋白质": 18.1,
            "碳水化合物": 13.0,
            "脂肪": 3.6
        },
        "黑豆": {
            "卡路里": 341.0,
            "蛋白质": 21.6,
            "碳水化合物": 62.36,
            "脂肪": 1.42
        },
        "烤麸": {
            "卡路里": 121.0,
            "蛋白质": 20.4,
            "碳水化合物": 9.3,
            "脂肪": 0.3
        },
        "大豆（绿色、熟）": {
            "卡路里": 141.0,
            "蛋白质": 12.35,
            "碳水化合物": 11.05,
            "脂肪": 6.4
        },
        "枝竹": {
            "卡路里": 478.0,
            "蛋白质": 44.4,
            "碳水化合物": 20.8,
            "脂肪": 24.7
        },
        "豆类（烘焙，罐装）": {
            "卡路里": 94.0,
            "蛋白质": 4.75,
            "碳水化合物": 21.14,
            "脂肪": 0.37
        },
        "纳豆": {
            "卡路里": 211.0,
            "蛋白质": 19.4,
            "碳水化合物": 12.68,
            "脂肪": 11.0
        },
        "豆腐干": {
            "卡路里": 142.0,
            "蛋白质": 16.2,
            "碳水化合物": 11.5,
            "脂肪": 3.6
        },
        "豆腐干（菜干）": {
            "卡路里": 137.0,
            "蛋白质": 13.4,
            "碳水化合物": 5.0,
            "脂肪": 7.1
        },
        "豆腐干（臭干）": {
            "卡路里": 99.0,
            "蛋白质": 10.2,
            "碳水化合物": 4.5,
            "脂肪": 4.6
        },
        "炸素虾": {
            "卡路里": 582.0,
            "蛋白质": 27.6,
            "碳水化合物": 19.3,
            "脂肪": 44.4
        },
        "腐竹": {
            "卡路里": 461.0,
            "蛋白质": 44.6,
            "碳水化合物": 22.3,
            "脂肪": 21.7
        },
        "大豆粉（脱脂）": {
            "卡路里": 327.0,
            "蛋白质": 51.46,
            "碳水化合物": 33.92,
            "脂肪": 1.22
        },
        "素火腿": {
            "卡路里": 213.0,
            "蛋白质": 19.1,
            "碳水化合物": 4.8,
            "脂肪": 13.2
        },
        "豆腐皮": {
            "卡路里": 410.0,
            "蛋白质": 44.6,
            "碳水化合物": 18.8,
            "脂肪": 17.4
        },
        "千张（百页）": {
            "卡路里": 262.0,
            "蛋白质": 24.5,
            "碳水化合物": 5.5,
            "脂肪": 16.0
        },
        "油豆腐": {
            "卡路里": 245.0,
            "蛋白质": 17.0,
            "碳水化合物": 4.9,
            "脂肪": 17.6
        },
        "豆腐丝（油）": {
            "卡路里": 304.0,
            "蛋白质": 24.2,
            "碳水化合物": 14.5,
            "脂肪": 17.1
        },
        "豆腐丝（干）": {
            "卡路里": 451.0,
            "蛋白质": 57.7,
            "碳水化合物": 3.7,
            "脂肪": 22.8
        },
        "豆奶（豆乳）": {
            "卡路里": 30.0,
            "蛋白质": 2.4,
            "碳水化合物": 1.8,
            "脂肪": 1.5
        },
        "酸豆奶": {
            "卡路里": 67.0,
            "蛋白质": 2.2,
            "碳水化合物": 11.8,
            "脂肪": 1.2
        },
        "豆浆": {
            "卡路里": 16.0,
            "蛋白质": 1.8,
            "碳水化合物": 1.1,
            "脂肪": 0.7
        },
        "豆腐（内脂）": {
            "卡路里": 50.0,
            "蛋白质": 5.0,
            "碳水化合物": 3.3,
            "脂肪": 1.9
        },
        "豆腐（北方）": {
            "卡路里": 99.0,
            "蛋白质": 12.2,
            "碳水化合物": 2.0,
            "脂肪": 4.8
        },
        "豆腐脑（老豆腐）": {
            "卡路里": 15.0,
            "蛋白质": 1.9,
            "碳水化合物": 0,
            "脂肪": 0.8
        },
        "豆腐花": {
            "卡路里": 401.0,
            "蛋白质": 10.0,
            "碳水化合物": 84.3,
            "脂肪": 2.6
        },
        "豆腐（南方）": {
            "卡路里": 57.0,
            "蛋白质": 6.2,
            "碳水化合物": 2.6,
            "脂肪": 2.5
        },
        "豆浆粉": {
            "卡路里": 426.0,
            "蛋白质": 19.7,
            "碳水化合物": 66.8,
            "脂肪": 9.4
        },
        "豆粕（膨化）": {
            "卡路里": 333.0,
            "蛋白质": 36.6,
            "碳水化合物": 48.0,
            "脂肪": 0.7
        },
        "黄豆粉": {
            "卡路里": 432.0,
            "蛋白质": 32.7,
            "碳水化合物": 37.6,
            "脂肪": 18.3
        },
        "黄豆（大豆）": {
            "卡路里": 390.0,
            "蛋白质": 35.0,
            "碳水化合物": 34.2,
            "脂肪": 16.0
        },
        "青豆": {
            "卡路里": 398.0,
            "蛋白质": 34.5,
            "碳水化合物": 35.4,
            "脂肪": 16.0
        },
        "豆腐丝": {
            "卡路里": 203.0,
            "蛋白质": 21.5,
            "碳水化合物": 6.2,
            "脂肪": 10.5
        }
    },
    "蔬菜": {
        "芸豆芽（熟）": {
            "卡路里": 33.0,
            "蛋白质": 4.83,
            "碳水化合物": 4.72,
            "脂肪": 0.58
        },
        "西红柿（番茄）": {
            "卡路里": 20.0,
            "蛋白质": 0.9,
            "碳水化合物": 4.0,
            "脂肪": 0.2
        },
        "芸豆芽": {
            "卡路里": 29.0,
            "蛋白质": 4.2,
            "碳水化合物": 4.1,
            "脂肪": 0.5
        },
        "芹菜": {
            "卡路里": 14.0,
            "蛋白质": 0.69,
            "碳水化合物": 2.97,
            "脂肪": 0.17
        },
        "菊苣": {
            "卡路里": 23.0,
            "蛋白质": 1.7,
            "碳水化合物": 4.7,
            "脂肪": 0.3
        },
        "莙荙菜": {
            "卡路里": 19.0,
            "蛋白质": 1.8,
            "碳水化合物": 3.74,
            "脂肪": 0.2
        },
        "花椰菜": {
            "卡路里": 25.0,
            "蛋白质": 1.92,
            "碳水化合物": 4.97,
            "脂肪": 0.28
        },
        "块根芹菜": {
            "卡路里": 42.0,
            "蛋白质": 1.5,
            "碳水化合物": 9.2,
            "脂肪": 0.3
        },
        "花椰菜（冷冻）": {
            "卡路里": 24.0,
            "蛋白质": 2.01,
            "碳水化合物": 4.68,
            "脂肪": 0.27
        },
        "茄子": {
            "卡路里": 23.0,
            "蛋白质": 1.1,
            "碳水化合物": 4.9,
            "脂肪": 0.2
        },
        "苜蓿籽": {
            "卡路里": 359.0,
            "蛋白质": 36.4,
            "碳水化合物": 39.9,
            "脂肪": 8.7
        },
        "茄子（绿皮）": {
            "卡路里": 28.0,
            "蛋白质": 1.0,
            "碳水化合物": 5.2,
            "脂肪": 0.6
        },
        "茄子（紫皮、长）": {
            "卡路里": 23.0,
            "蛋白质": 1.0,
            "碳水化合物": 5.4,
            "脂肪": 0.1
        },
        "朝鲜蓟": {
            "卡路里": 47.0,
            "蛋白质": 3.27,
            "碳水化合物": 10.51,
            "脂肪": 0.15
        },
        "苜蓿（草头、金花菜）": {
            "卡路里": 64.0,
            "蛋白质": 3.9,
            "碳水化合物": 10.9,
            "脂肪": 1.0
        },
        "蕨菜": {
            "卡路里": 42.0,
            "蛋白质": 1.6,
            "碳水化合物": 9.0,
            "脂肪": 0.4
        },
        "茄子（圆）": {
            "卡路里": 32.0,
            "蛋白质": 1.6,
            "碳水化合物": 6.7,
            "脂肪": 0.2
        },
        "荞菜（野荞）": {
            "卡路里": 13.0,
            "蛋白质": 0.7,
            "碳水化合物": 2.7,
            "脂肪": 0.2
        },
        "朝鲜蓟（全球或法国、熟）": {
            "卡路里": 53.0,
            "蛋白质": 2.89,
            "碳水化合物": 11.95,
            "脂肪": 0.34
        },
        "紫花苜蓿种子芽": {
            "卡路里": 23.0,
            "蛋白质": 3.99,
            "碳水化合物": 2.1,
            "脂肪": 0.69
        },
        "花椰菜（冷冻、熟）": {
            "卡路里": 19.0,
            "蛋白质": 1.61,
            "碳水化合物": 3.75,
            "脂肪": 0.22
        },
        "榆钱": {
            "卡路里": 45.0,
            "蛋白质": 4.8,
            "碳水化合物": 7.6,
            "脂肪": 0.4
        },
        "球茎茴香": {
            "卡路里": 31.0,
            "蛋白质": 1.24,
            "碳水化合物": 7.3,
            "脂肪": 0.2
        },
        "耶路撒冷朝鲜蓟": {
            "卡路里": 73.0,
            "蛋白质": 2.0,
            "碳水化合物": 17.44,
            "脂肪": 0.01
        },
        "花椰菜（熟）": {
            "卡路里": 23.0,
            "蛋白质": 1.84,
            "碳水化合物": 4.11,
            "脂肪": 0.45
        },
        "汤菜": {
            "卡路里": 24.0,
            "蛋白质": 1.8,
            "碳水化合物": 3.4,
            "脂肪": 0.5
        },
        "野蒜（小蒜、野葱）": {
            "卡路里": 34.0,
            "蛋白质": 1.0,
            "碳水化合物": 7.7,
            "脂肪": 0.4
        },
        "枸杞（枸杞菜、地骨）": {
            "卡路里": 47.0,
            "蛋白质": 5.6,
            "碳水化合物": 4.5,
            "脂肪": 1.1
        },
        "蕨菜（脱水）": {
            "卡路里": 302.0,
            "蛋白质": 6.6,
            "碳水化合物": 79.7,
            "脂肪": 0.9
        },
        "食用黄麻": {
            "卡路里": 34.0,
            "蛋白质": 4.65,
            "碳水化合物": 5.8,
            "脂肪": 0.25
        },
        "食用大黄": {
            "卡路里": 9.0,
            "蛋白质": 1.6,
            "碳水化合物": 1.5,
            "脂肪": 0.2
        },
        "香茅": {
            "卡路里": 99.0,
            "蛋白质": 1.82,
            "碳水化合物": 25.31,
            "脂肪": 0.49
        },
        "婆罗门参": {
            "卡路里": 82.0,
            "蛋白质": 3.3,
            "碳水化合物": 18.6,
            "脂肪": 0.2
        },
        "婆罗门参（黑）": {
            "卡路里": 82.0,
            "蛋白质": 3.3,
            "碳水化合物": 18.6,
            "脂肪": 0.2
        },
        "蒲公英叶": {
            "卡路里": 53.0,
            "蛋白质": 4.8,
            "碳水化合物": 7.0,
            "脂肪": 1.1
        },
        "蒌蒿": {
            "卡路里": 57.0,
            "蛋白质": 3.7,
            "碳水化合物": 9.0,
            "脂肪": 0.7
        },
        "罗勒": {
            "卡路里": 26.0,
            "蛋白质": 3.8,
            "碳水化合物": 4.6,
            "脂肪": 0.64
        },
        "香椿（香椿芽）": {
            "卡路里": 50.0,
            "蛋白质": 1.7,
            "碳水化合物": 10.9,
            "脂肪": 0.4
        },
        "地笋": {
            "卡路里": 69.0,
            "蛋白质": 4.3,
            "碳水化合物": 13.7,
            "脂肪": 0.7
        },
        "苣荬菜（败酱草）": {
            "卡路里": 17.0,
            "蛋白质": 1.25,
            "碳水化合物": 3.35,
            "脂肪": 0.2
        },
        "小蓟": {
            "卡路里": 42.0,
            "蛋白质": 4.5,
            "碳水化合物": 5.9,
            "脂肪": 0.4
        },
        "地肤": {
            "卡路里": 65.0,
            "蛋白质": 5.2,
            "碳水化合物": 10.8,
            "脂肪": 0.8
        },
        "刺楸": {
            "卡路里": 42.0,
            "蛋白质": 2.71,
            "碳水化合物": 7.49,
            "脂肪": 0.11
        },
        "山药（熟）": {
            "卡路里": 116.0,
            "蛋白质": 1.49,
            "碳水化合物": 27.48,
            "脂肪": 0.14
        },
        "败酱": {
            "卡路里": 69.0,
            "蛋白质": 1.5,
            "碳水化合物": 17.3,
            "脂肪": 1.0
        },
        "百里香（山椒、麝香草）": {
            "卡路里": 101.0,
            "蛋白质": 5.56,
            "碳水化合物": 24.45,
            "脂肪": 1.68
        },
        "马兰头": {
            "卡路里": 28.0,
            "蛋白质": 2.4,
            "碳水化合物": 4.6,
            "脂肪": 0.4
        },
        "姜（干）": {
            "卡路里": 308.0,
            "蛋白质": 9.1,
            "碳水化合物": 64.0,
            "脂肪": 5.7
        },
        "番杏": {
            "卡路里": 14.0,
            "蛋白质": 1.5,
            "碳水化合物": 2.5,
            "脂肪": 0.2
        },
        "山药（干）": {
            "卡路里": 327.0,
            "蛋白质": 9.4,
            "碳水化合物": 70.8,
            "脂肪": 1.0
        },
        "姜（子姜）": {
            "卡路里": 21.0,
            "蛋白质": 0.7,
            "碳水化合物": 3.7,
            "脂肪": 0.6
        },
        "姜": {
            "卡路里": 46.0,
            "蛋白质": 1.3,
            "碳水化合物": 10.3,
            "脂肪": 0.6
        },
        "山药": {
            "卡路里": 327.0,
            "蛋白质": 9.4,
            "碳水化合物": 70.8,
            "脂肪": 1.0
        },
        "琼脂": {
            "卡路里": 26.0,
            "蛋白质": 0.54,
            "碳水化合物": 6.75,
            "脂肪": 0.03
        },
        "荸荠": {
            "卡路里": 61.0,
            "蛋白质": 1.2,
            "碳水化合物": 14.2,
            "脂肪": 0.2
        },
        "莼菜": {
            "卡路里": 21.0,
            "蛋白质": 1.4,
            "碳水化合物": 3.8,
            "脂肪": 0.1
        },
        "蒲菜（香蒲、甘蒲、野茭白）": {
            "卡路里": 14.0,
            "蛋白质": 1.2,
            "碳水化合物": 2.4,
            "脂肪": 0.1
        },
        "菊芋（洋姜）": {
            "卡路里": 64.0,
            "蛋白质": 2.4,
            "碳水化合物": 15.8,
            "脂肪": 0
        },
        "慈菇（熟）": {
            "卡路里": 78.0,
            "蛋白质": 4.49,
            "碳水化合物": 16.14,
            "脂肪": 0.1
        },
        "莲藕": {
            "卡路里": 74.0,
            "蛋白质": 2.6,
            "碳水化合物": 17.23,
            "脂肪": 0.1
        },
        "水芹": {
            "卡路里": 32.0,
            "蛋白质": 2.6,
            "碳水化合物": 5.5,
            "脂肪": 0.7
        },
        "大薯（参薯）": {
            "卡路里": 108.0,
            "蛋白质": 2.1,
            "碳水化合物": 24.9,
            "脂肪": 0.2
        },
        "地瓜叶": {
            "卡路里": 60.0,
            "蛋白质": 4.8,
            "碳水化合物": 9.0,
            "脂肪": 0.7
        },
        "琉璃苣（熟）": {
            "卡路里": 25.0,
            "蛋白质": 2.09,
            "碳水化合物": 3.55,
            "脂肪": 0.81
        },
        "菱角": {
            "卡路里": 101.0,
            "蛋白质": 4.5,
            "碳水化合物": 21.4,
            "脂肪": 0.1
        },
        "甜菜叶（熟）": {
            "卡路里": 27.0,
            "蛋白质": 2.57,
            "碳水化合物": 5.46,
            "脂肪": 0.2
        },
        "葡萄叶": {
            "卡路里": 93.0,
            "蛋白质": 5.6,
            "碳水化合物": 17.31,
            "脂肪": 2.12
        },
        "琉璃苣": {
            "卡路里": 25.0,
            "蛋白质": 2.09,
            "碳水化合物": 3.55,
            "脂肪": 0.81
        },
        "甜菜叶": {
            "卡路里": 22.0,
            "蛋白质": 2.2,
            "碳水化合物": 4.33,
            "脂肪": 0.13
        },
        "茭白": {
            "卡路里": 26.0,
            "蛋白质": 1.2,
            "碳水化合物": 5.9,
            "脂肪": 0.2
        },
        "藕（莲藕）": {
            "卡路里": 73.0,
            "蛋白质": 1.9,
            "碳水化合物": 16.4,
            "脂肪": 0.2
        },
        "水芹菜": {
            "卡路里": 13.0,
            "蛋白质": 1.4,
            "碳水化合物": 1.8,
            "脂肪": 0.2
        },
        "豆瓣菜（西洋菜）": {
            "卡路里": 20.0,
            "蛋白质": 2.9,
            "碳水化合物": 1.5,
            "脂肪": 0.5
        },
        "慈姑": {
            "卡路里": 97.0,
            "蛋白质": 4.6,
            "碳水化合物": 19.9,
            "脂肪": 0.2
        },
        "沙葛（豆薯、凉薯）": {
            "卡路里": 57.0,
            "蛋白质": 0.9,
            "碳水化合物": 13.4,
            "脂肪": 0.1
        },
        "竹笋": {
            "卡路里": 27.0,
            "蛋白质": 2.6,
            "碳水化合物": 5.2,
            "脂肪": 0.3
        },
        "粉葛（葛、葛薯）": {
            "卡路里": 150.0,
            "蛋白质": 2.2,
            "碳水化合物": 36.1,
            "脂肪": 0.2
        },
        "竹笋（熟）": {
            "卡路里": 11.0,
            "蛋白质": 1.53,
            "碳水化合物": 1.52,
            "脂肪": 0.22
        },
        "芦笋（熟）": {
            "卡路里": 22.0,
            "蛋白质": 2.4,
            "碳水化合物": 4.11,
            "脂肪": 0.22
        },
        "芦笋（罐头）": {
            "卡路里": 15.0,
            "蛋白质": 1.8,
            "碳水化合物": 2.48,
            "脂肪": 0.18
        },
        "芦笋（冷冻）": {
            "卡路里": 24.0,
            "蛋白质": 3.23,
            "碳水化合物": 4.1,
            "脂肪": 0.23
        },
        "芦笋（冷冻、熟）": {
            "卡路里": 18.0,
            "蛋白质": 2.95,
            "碳水化合物": 1.92,
            "脂肪": 0.42
        },
        "龙舌兰（干）": {
            "卡路里": 341.0,
            "蛋白质": 1.71,
            "碳水化合物": 81.98,
            "脂肪": 0.69
        },
        "竹笋（罐头）": {
            "卡路里": 19.0,
            "蛋白质": 1.72,
            "碳水化合物": 3.22,
            "脂肪": 0.4
        },
        "龙舌兰": {
            "卡路里": 68.0,
            "蛋白质": 0.52,
            "碳水化合物": 16.23,
            "脂肪": 0.15
        },
        "芦笋（罐装）": {
            "卡路里": 19.0,
            "蛋白质": 2.14,
            "碳水化合物": 2.46,
            "脂肪": 0.65
        },
        "苋菜叶": {
            "卡路里": 23.0,
            "蛋白质": 2.46,
            "碳水化合物": 4.02,
            "脂肪": 0.33
        },
        "苋菜叶（熟）": {
            "卡路里": 21.0,
            "蛋白质": 2.11,
            "碳水化合物": 4.11,
            "脂肪": 0.18
        },
        "落葵": {
            "卡路里": 19.0,
            "蛋白质": 1.8,
            "碳水化合物": 3.4,
            "脂肪": 0.3
        },
        "龙舌兰（熟）": {
            "卡路里": 135.0,
            "蛋白质": 0.99,
            "碳水化合物": 32.0,
            "脂肪": 0.29
        },
        "萝卜叶": {
            "卡路里": 32.0,
            "蛋白质": 1.5,
            "碳水化合物": 7.13,
            "脂肪": 0.3
        },
        "芋头叶": {
            "卡路里": 42.0,
            "蛋白质": 4.98,
            "碳水化合物": 6.7,
            "脂肪": 0.74
        },
        "红薯叶": {
            "卡路里": 42.0,
            "蛋白质": 2.49,
            "碳水化合物": 8.82,
            "脂肪": 0.51
        },
        "芋头叶（熟）": {
            "卡路里": 24.0,
            "蛋白质": 2.72,
            "碳水化合物": 4.02,
            "脂肪": 0.41
        },
        "新西兰菠菜": {
            "卡路里": 14.0,
            "蛋白质": 1.5,
            "碳水化合物": 2.5,
            "脂肪": 0.2
        },
        "菠菜": {
            "卡路里": 23.0,
            "蛋白质": 2.86,
            "碳水化合物": 3.63,
            "脂肪": 0.39
        },
        "红薯叶（熟）": {
            "卡路里": 35.0,
            "蛋白质": 2.18,
            "碳水化合物": 7.38,
            "脂肪": 0.34
        },
        "德国酸菜（罐头）": {
            "卡路里": 19.0,
            "蛋白质": 0.91,
            "碳水化合物": 4.28,
            "脂肪": 0.14
        },
        "欧洲防风草": {
            "卡路里": 75.0,
            "蛋白质": 1.2,
            "碳水化合物": 17.99,
            "脂肪": 0.3
        },
        "芜菁甘蓝": {
            "卡路里": 37.0,
            "蛋白质": 1.08,
            "碳水化合物": 8.62,
            "脂肪": 0.16
        },
        "欧芹": {
            "卡路里": 36.0,
            "蛋白质": 2.97,
            "碳水化合物": 6.33,
            "脂肪": 0.79
        },
        "长叶莴苣": {
            "卡路里": 17.0,
            "蛋白质": 1.23,
            "碳水化合物": 3.29,
            "脂肪": 0.3
        },
        "莴苣": {
            "卡路里": 13.0,
            "蛋白质": 1.35,
            "碳水化合物": 2.23,
            "脂肪": 0.22
        },
        "球茎甘蓝": {
            "卡路里": 27.0,
            "蛋白质": 1.7,
            "碳水化合物": 6.2,
            "脂肪": 0.1
        },
        "卷心莴苣": {
            "卡路里": 14.0,
            "蛋白质": 0.9,
            "碳水化合物": 2.97,
            "脂肪": 0.14
        },
        "萝卜芽": {
            "卡路里": 43.0,
            "蛋白质": 3.81,
            "碳水化合物": 3.6,
            "脂肪": 2.53
        },
        "菠菜（冷冻）": {
            "卡路里": 29.0,
            "蛋白质": 3.63,
            "碳水化合物": 4.21,
            "脂肪": 0.57
        },
        "茴香（鳞茎）": {
            "卡路里": 31.0,
            "蛋白质": 1.24,
            "碳水化合物": 7.3,
            "脂肪": 0.2
        },
        "辣木叶": {
            "卡路里": 64.0,
            "蛋白质": 9.4,
            "碳水化合物": 8.28,
            "脂肪": 1.4
        },
        "芥菜": {
            "卡路里": 27.0,
            "蛋白质": 2.86,
            "碳水化合物": 4.67,
            "脂肪": 0.42
        },
        "水芹（熟）": {
            "卡路里": 23.0,
            "蛋白质": 1.9,
            "碳水化合物": 3.8,
            "脂肪": 0.6
        },
        "紫叶菊苣": {
            "卡路里": 23.0,
            "蛋白质": 1.43,
            "碳水化合物": 4.48,
            "脂肪": 0.25
        },
        "酸模": {
            "卡路里": 22.0,
            "蛋白质": 2.0,
            "碳水化合物": 3.2,
            "脂肪": 0.7
        },
        "生菜（红）": {
            "卡路里": 13.0,
            "蛋白质": 1.33,
            "碳水化合物": 2.26,
            "脂肪": 0.22
        },
        "羽衣甘蓝": {
            "卡路里": 32.0,
            "蛋白质": 3.02,
            "碳水化合物": 5.42,
            "脂肪": 0.61
        },
        "韭菜": {
            "卡路里": 30.0,
            "蛋白质": 3.27,
            "碳水化合物": 4.35,
            "脂肪": 0.73
        },
        "卷心菜": {
            "卡路里": 25.0,
            "蛋白质": 1.28,
            "碳水化合物": 5.8,
            "脂肪": 0.1
        },
        "香菜叶": {
            "卡路里": 23.0,
            "蛋白质": 2.13,
            "碳水化合物": 3.67,
            "脂肪": 0.52
        },
        "卷心菜（红色）": {
            "卡路里": 31.0,
            "蛋白质": 1.43,
            "碳水化合物": 7.37,
            "脂肪": 0.16
        },
        "卷心菜（熟）": {
            "卡路里": 23.0,
            "蛋白质": 1.27,
            "碳水化合物": 5.51,
            "脂肪": 0.06
        },
        "卷心菜（皱叶甘蓝）": {
            "卡路里": 27.0,
            "蛋白质": 2.0,
            "碳水化合物": 6.1,
            "脂肪": 0.1
        },
        "韭菜（鳞茎和下部叶）": {
            "卡路里": 61.0,
            "蛋白质": 1.5,
            "碳水化合物": 14.15,
            "脂肪": 0.3
        },
        "马齿苋": {
            "卡路里": 20.0,
            "蛋白质": 2.03,
            "碳水化合物": 3.39,
            "脂肪": 0.36
        },
        "卷心菜（皱叶甘蓝、熟）": {
            "卡路里": 24.0,
            "蛋白质": 1.8,
            "碳水化合物": 5.41,
            "脂肪": 0.09
        },
        "生菜": {
            "卡路里": 15.0,
            "蛋白质": 1.36,
            "碳水化合物": 2.87,
            "脂肪": 0.15
        },
        "西兰花（熟）": {
            "卡路里": 35.0,
            "蛋白质": 2.38,
            "碳水化合物": 7.18,
            "脂肪": 0.41
        },
        "芦笋": {
            "卡路里": 20.0,
            "蛋白质": 2.2,
            "碳水化合物": 3.88,
            "脂肪": 0.12
        },
        "抱子甘蓝": {
            "卡路里": 43.0,
            "蛋白质": 3.38,
            "碳水化合物": 8.95,
            "脂肪": 0.3
        },
        "芝麻菜": {
            "卡路里": 25.0,
            "蛋白质": 2.58,
            "碳水化合物": 3.65,
            "脂肪": 0.66
        },
        "抱子甘蓝（熟）": {
            "卡路里": 36.0,
            "蛋白质": 2.55,
            "碳水化合物": 7.1,
            "脂肪": 0.5
        },
        "芦笋（龙须菜）": {
            "卡路里": 22.0,
            "蛋白质": 1.4,
            "碳水化合物": 4.9,
            "脂肪": 0.1
        },
        "鞭笋": {
            "卡路里": 24.0,
            "蛋白质": 2.6,
            "碳水化合物": 6.7,
            "脂肪": 0
        },
        "毛笋": {
            "卡路里": 23.0,
            "蛋白质": 2.2,
            "碳水化合物": 3.8,
            "脂肪": 0.2
        },
        "西兰花": {
            "卡路里": 34.0,
            "蛋白质": 2.82,
            "碳水化合物": 6.64,
            "脂肪": 0.37
        },
        "百合（干）": {
            "卡路里": 346.0,
            "蛋白质": 6.7,
            "碳水化合物": 79.5,
            "脂肪": 0.5
        },
        "西兰花（冷冻）": {
            "卡路里": 26.0,
            "蛋白质": 2.81,
            "碳水化合物": 4.78,
            "脂肪": 0.29
        },
        "百合": {
            "卡路里": 166.0,
            "蛋白质": 3.2,
            "碳水化合物": 38.8,
            "脂肪": 0.1
        },
        "黑笋（干）": {
            "卡路里": 268.0,
            "蛋白质": 17.6,
            "碳水化合物": 57.5,
            "脂肪": 2.4
        },
        "卷心菜（红色、熟）": {
            "卡路里": 29.0,
            "蛋白质": 1.51,
            "碳水化合物": 6.94,
            "脂肪": 0.09
        },
        "冬笋": {
            "卡路里": 42.0,
            "蛋白质": 4.1,
            "碳水化合物": 6.5,
            "脂肪": 0.1
        },
        "玉兰片": {
            "卡路里": 66.0,
            "蛋白质": 2.6,
            "碳水化合物": 18.6,
            "脂肪": 0.4
        },
        "春笋": {
            "卡路里": 25.0,
            "蛋白质": 2.4,
            "碳水化合物": 5.1,
            "脂肪": 0.1
        },
        "荠菜": {
            "卡路里": 31.0,
            "蛋白质": 2.9,
            "碳水化合物": 4.7,
            "脂肪": 0.4
        },
        "百合（脱水）": {
            "卡路里": 346.0,
            "蛋白质": 8.1,
            "碳水化合物": 79.1,
            "脂肪": 0.1
        },
        "生菜（油麦菜）": {
            "卡路里": 16.0,
            "蛋白质": 1.4,
            "碳水化合物": 2.1,
            "脂肪": 0.4
        },
        "茼蒿": {
            "卡路里": 24.0,
            "蛋白质": 1.9,
            "碳水化合物": 3.9,
            "脂肪": 0.3
        },
        "蕹菜（空心菜）": {
            "卡路里": 23.0,
            "蛋白质": 2.2,
            "碳水化合物": 3.6,
            "脂肪": 0.3
        },
        "白笋（干）": {
            "卡路里": 282.0,
            "蛋白质": 26.0,
            "碳水化合物": 57.1,
            "脂肪": 4.0
        },
        "茴香（小茴香）": {
            "卡路里": 27.0,
            "蛋白质": 2.5,
            "碳水化合物": 4.2,
            "脂肪": 0.3
        },
        "芹菜叶": {
            "卡路里": 35.0,
            "蛋白质": 2.6,
            "碳水化合物": 5.9,
            "脂肪": 0.6
        },
        "苋菜（绿）": {
            "卡路里": 30.0,
            "蛋白质": 2.8,
            "碳水化合物": 5.0,
            "脂肪": 0.3
        },
        "生菜（叶用莴苣）": {
            "卡路里": 15.0,
            "蛋白质": 1.3,
            "碳水化合物": 2.0,
            "脂肪": 0.3
        },
        "香菜（脱水）": {
            "卡路里": 310.0,
            "蛋白质": 7.4,
            "碳水化合物": 71.2,
            "脂肪": 1.3
        },
        "莴笋（莴苣）": {
            "卡路里": 15.0,
            "蛋白质": 1.0,
            "碳水化合物": 2.8,
            "脂肪": 0.1
        },
        "芹菜茎": {
            "卡路里": 22.0,
            "蛋白质": 1.2,
            "碳水化合物": 4.5,
            "脂肪": 0.2
        },
        "菠菜（脱水）": {
            "卡路里": 308.0,
            "蛋白质": 6.4,
            "碳水化合物": 75.7,
            "脂肪": 0.6
        },
        "黄花菜（金针菜）": {
            "卡路里": 214.0,
            "蛋白质": 19.4,
            "碳水化合物": 34.9,
            "脂肪": 1.4
        },
        "萝卜缨": {
            "卡路里": 38.0,
            "蛋白质": 3.1,
            "碳水化合物": 7.6,
            "脂肪": 0.1
        },
        "香菜": {
            "卡路里": 33.0,
            "蛋白质": 1.8,
            "碳水化合物": 6.2,
            "脂肪": 0.4
        },
        "苋菜（紫）": {
            "卡路里": 35.0,
            "蛋白质": 2.8,
            "碳水化合物": 5.9,
            "脂肪": 0.4
        },
        "芥菜（小叶）": {
            "卡路里": 26.0,
            "蛋白质": 2.5,
            "碳水化合物": 3.6,
            "脂肪": 0.4
        },
        "芥菜（大叶）": {
            "卡路里": 16.0,
            "蛋白质": 1.8,
            "碳水化合物": 2.0,
            "脂肪": 0.4
        },
        "甘蓝菜": {
            "卡路里": 22.0,
            "蛋白质": 2.8,
            "碳水化合物": 2.6,
            "脂肪": 0.4
        },
        "西兰花（绿菜花）": {
            "卡路里": 36.0,
            "蛋白质": 4.1,
            "碳水化合物": 4.3,
            "脂肪": 0.6
        },
        "芥菜（茎用）": {
            "卡路里": 13.0,
            "蛋白质": 1.3,
            "碳水化合物": 2.8,
            "脂肪": 0.2
        },
        "菜花（脱水）": {
            "卡路里": 312.0,
            "蛋白质": 6.5,
            "碳水化合物": 76.8,
            "脂肪": 0.6
        },
        "芥菜（雪里红、雪菜）": {
            "卡路里": 27.0,
            "蛋白质": 2.0,
            "碳水化合物": 4.7,
            "脂肪": 0.4
        },
        "落葵（木耳菜）": {
            "卡路里": 23.0,
            "蛋白质": 1.6,
            "碳水化合物": 4.3,
            "脂肪": 0.3
        },
        "萝卜缨（小萝卜）": {
            "卡路里": 23.0,
            "蛋白质": 1.6,
            "碳水化合物": 4.1,
            "脂肪": 0.3
        },
        "胡萝卜缨": {
            "卡路里": 48.0,
            "蛋白质": 1.7,
            "碳水化合物": 11.3,
            "脂肪": 0.4
        },
        "冬葵（冬苋菜）": {
            "卡路里": 34.0,
            "蛋白质": 3.9,
            "碳水化合物": 4.9,
            "脂肪": 0.4
        },
        "油菜（小）": {
            "卡路里": 12.0,
            "蛋白质": 1.3,
            "碳水化合物": 1.6,
            "脂肪": 0.2
        },
        "大白菜（脱水）": {
            "卡路里": 305.0,
            "蛋白质": 6.2,
            "碳水化合物": 72.9,
            "脂肪": 0.8
        },
        "苦菜（节节花）": {
            "卡路里": 46.0,
            "蛋白质": 2.8,
            "碳水化合物": 10.0,
            "脂肪": 0.6
        },
        "酸菜": {
            "卡路里": 15.0,
            "蛋白质": 1.1,
            "碳水化合物": 2.4,
            "脂肪": 0.2
        },
        "油菜": {
            "卡路里": 25.0,
            "蛋白质": 1.8,
            "碳水化合物": 3.8,
            "脂肪": 0.5
        },
        "菜薹": {
            "卡路里": 28.0,
            "蛋白质": 2.8,
            "碳水化合物": 4.0,
            "脂肪": 0.5
        },
        "乌塌菜": {
            "卡路里": 28.0,
            "蛋白质": 2.6,
            "碳水化合物": 4.2,
            "脂肪": 0.4
        },
        "大白菜（小白口）": {
            "卡路里": 16.0,
            "蛋白质": 1.3,
            "碳水化合物": 2.8,
            "脂肪": 0.1
        },
        "瓤儿白（瓤儿菜）": {
            "卡路里": 18.0,
            "蛋白质": 1.7,
            "碳水化合物": 3.2,
            "脂肪": 0.2
        },
        "油菜薹（菜薹）": {
            "卡路里": 24.0,
            "蛋白质": 3.2,
            "碳水化合物": 3.0,
            "脂肪": 0.4
        },
        "红菜薹（紫菜薹）": {
            "卡路里": 43.0,
            "蛋白质": 2.9,
            "碳水化合物": 2.7,
            "脂肪": 2.5
        },
        "甘蓝（卷心菜、圆白菜）": {
            "卡路里": 24.0,
            "蛋白质": 1.5,
            "碳水化合物": 4.6,
            "脂肪": 0.2
        },
        "油菜（脱水）": {
            "卡路里": 316.0,
            "蛋白质": 7.6,
            "碳水化合物": 74.3,
            "脂肪": 0.6
        },
        "小白菜": {
            "卡路里": 17.0,
            "蛋白质": 1.5,
            "碳水化合物": 2.7,
            "脂肪": 0.3
        },
        "大白菜": {
            "卡路里": 18.0,
            "蛋白质": 1.5,
            "碳水化合物": 3.2,
            "脂肪": 0.1
        },
        "菜花": {
            "卡路里": 26.0,
            "蛋白质": 2.1,
            "碳水化合物": 4.6,
            "脂肪": 0.2
        },
        "大白菜（青白口）": {
            "卡路里": 17.0,
            "蛋白质": 1.4,
            "碳水化合物": 3.0,
            "脂肪": 0.1
        },
        "油菜（黑）": {
            "卡路里": 19.0,
            "蛋白质": 1.8,
            "碳水化合物": 2.9,
            "脂肪": 0.2
        },
        "大蒜": {
            "卡路里": 149.0,
            "蛋白质": 6.36,
            "碳水化合物": 33.06,
            "脂肪": 0.5
        },
        "洋葱（威尔士）": {
            "卡路里": 34.0,
            "蛋白质": 1.9,
            "碳水化合物": 6.5,
            "脂肪": 0.4
        },
        "洋葱（紫皮、脱水）": {
            "卡路里": 339.0,
            "蛋白质": 6.9,
            "碳水化合物": 80.6,
            "脂肪": 0.4
        },
        "小洋葱或大葱（包括顶部和球茎）": {
            "卡路里": 32.0,
            "蛋白质": 1.83,
            "碳水化合物": 7.34,
            "脂肪": 0.19
        },
        "韭苔": {
            "卡路里": 37.0,
            "蛋白质": 2.2,
            "碳水化合物": 7.8,
            "脂肪": 0.1
        },
        "洋葱": {
            "卡路里": 40.0,
            "蛋白质": 1.1,
            "碳水化合物": 9.34,
            "脂肪": 0.1
        },
        "洋葱（白皮、脱水）": {
            "卡路里": 342.0,
            "蛋白质": 5.5,
            "碳水化合物": 81.9,
            "脂肪": 0.4
        },
        "薤白": {
            "卡路里": 124.0,
            "蛋白质": 3.4,
            "碳水化合物": 27.1,
            "脂肪": 0.4
        },
        "大葱（红皮）": {
            "卡路里": 49.0,
            "蛋白质": 2.4,
            "碳水化合物": 10.2,
            "脂肪": 0.1
        },
        "薤（皎头）": {
            "卡路里": 1.0,
            "蛋白质": 2.5,
            "碳水化合物": 16.8,
            "脂肪": 0.1
        },
        "韭黄": {
            "卡路里": 24.0,
            "蛋白质": 2.3,
            "碳水化合物": 3.9,
            "脂肪": 0.2
        }
    },
    "水果": {
        "木瓜": {
            "卡路里": 43.0,
            "蛋白质": 0.47,
            "碳水化合物": 10.82,
            "脂肪": 0.26
        },
        "香蕉香瓜": {
            "卡路里": 21.0,
            "蛋白质": 0.84,
            "碳水化合物": 4.06,
            "脂肪": 0.2
        },
        "西瓜（郑州三号）": {
            "卡路里": 26.0,
            "蛋白质": 0.6,
            "碳水化合物": 5.7,
            "脂肪": 0.1
        },
        "蜜瓜": {
            "卡路里": 36.0,
            "蛋白质": 0.54,
            "碳水化合物": 9.09,
            "脂肪": 0.14
        },
        "甜瓜（香瓜）": {
            "卡路里": 27.0,
            "蛋白质": 0.4,
            "碳水化合物": 6.2,
            "脂肪": 0.1
        },
        "哈密瓜": {
            "卡路里": 34.0,
            "蛋白质": 0.84,
            "碳水化合物": 8.16,
            "脂肪": 0.19
        },
        "猴面包树粉": {
            "卡路里": 250.0,
            "蛋白质": 3.69,
            "碳水化合物": 79.65,
            "脂肪": 0.47
        },
        "西瓜（京欣一号）": {
            "卡路里": 34.0,
            "蛋白质": 0.5,
            "碳水化合物": 8.1,
            "脂肪": 0
        },
        "西瓜": {
            "卡路里": 30.0,
            "蛋白质": 0.61,
            "碳水化合物": 7.55,
            "脂肪": 0.15
        },
        "山竹": {
            "卡路里": 73.0,
            "蛋白质": 0.41,
            "碳水化合物": 17.91,
            "脂肪": 0.58
        },
        "芒果": {
            "卡路里": 60.0,
            "蛋白质": 0.82,
            "碳水化合物": 14.98,
            "脂肪": 0.38
        },
        "菠萝": {
            "卡路里": 50.0,
            "蛋白质": 0.54,
            "碳水化合物": 13.12,
            "脂肪": 0.12
        },
        "香蕉（脱水）": {
            "卡路里": 346.0,
            "蛋白质": 3.89,
            "碳水化合物": 88.28,
            "脂肪": 1.81
        },
        "番荔枝": {
            "卡路里": 66.0,
            "蛋白质": 1.0,
            "碳水化合物": 16.84,
            "脂肪": 0.3
        },
        "菠萝（特甜品种）": {
            "卡路里": 51.0,
            "蛋白质": 0.53,
            "碳水化合物": 13.5,
            "脂肪": 0.11
        },
        "白金瓜": {
            "卡路里": 25.0,
            "蛋白质": 0.4,
            "碳水化合物": 6.2,
            "脂肪": 0
        },
        "百香果（紫色）": {
            "卡路里": 97.0,
            "蛋白质": 2.2,
            "碳水化合物": 23.38,
            "脂肪": 0.7
        },
        "榴莲": {
            "卡路里": 147.0,
            "蛋白质": 1.47,
            "碳水化合物": 27.09,
            "脂肪": 5.33
        },
        "海枣": {
            "卡路里": 282.0,
            "蛋白质": 2.45,
            "碳水化合物": 75.03,
            "脂肪": 0.39
        },
        "火龙果": {
            "卡路里": 62.0,
            "蛋白质": 0.88,
            "碳水化合物": 14.16,
            "脂肪": 0.0
        },
        "仙人掌果": {
            "卡路里": 41.0,
            "蛋白质": 0.73,
            "碳水化合物": 9.57,
            "脂肪": 0.51
        },
        "橄榄": {
            "卡路里": 57.0,
            "蛋白质": 0.8,
            "碳水化合物": 15.1,
            "脂肪": 0.2
        },
        "枇杷": {
            "卡路里": 41.0,
            "蛋白质": 0.8,
            "碳水化合物": 9.3,
            "脂肪": 0.2
        },
        "灵蜜瓜": {
            "卡路里": 4.0,
            "蛋白质": 0.5,
            "碳水化合物": 0.4,
            "脂肪": 0.1
        },
        "香蕉": {
            "卡路里": 89.0,
            "蛋白质": 1.09,
            "碳水化合物": 22.84,
            "脂肪": 0.33
        },
        "杨桃": {
            "卡路里": 31.0,
            "蛋白质": 0.6,
            "碳水化合物": 7.4,
            "脂肪": 0.2
        },
        "椰子": {
            "卡路里": 241.0,
            "蛋白质": 4.0,
            "碳水化合物": 31.3,
            "脂肪": 12.1
        },
        "桂圆（干）": {
            "卡路里": 277.0,
            "蛋白质": 5.0,
            "碳水化合物": 64.8,
            "脂肪": 0.2
        },
        "余甘子": {
            "卡路里": 45.0,
            "蛋白质": 0.3,
            "碳水化合物": 12.4,
            "脂肪": 0.1
        },
        "人参果": {
            "卡路里": 87.0,
            "蛋白质": 0.6,
            "碳水化合物": 21.2,
            "脂肪": 0.7
        },
        "黄皮果": {
            "卡路里": 39.0,
            "蛋白质": 1.6,
            "碳水化合物": 9.9,
            "脂肪": 0.2
        },
        "桂圆肉": {
            "卡路里": 317.0,
            "蛋白质": 4.6,
            "碳水化合物": 73.5,
            "脂肪": 1.0
        },
        "桂圆": {
            "卡路里": 71.0,
            "蛋白质": 1.2,
            "碳水化合物": 16.6,
            "脂肪": 0.1
        },
        "杨梅": {
            "卡路里": 30.0,
            "蛋白质": 0.8,
            "碳水化合物": 6.7,
            "脂肪": 0.2
        },
        "柑橘（蜜橘）": {
            "卡路里": 53.0,
            "蛋白质": 0.81,
            "碳水化合物": 13.34,
            "脂肪": 0.31
        },
        "番石榴": {
            "卡路里": 53.0,
            "蛋白质": 1.1,
            "碳水化合物": 14.2,
            "脂肪": 0.4
        },
        "葡萄柚（粉红色）": {
            "卡路里": 42.0,
            "蛋白质": 0.77,
            "碳水化合物": 10.66,
            "脂肪": 0.14
        },
        "柚子": {
            "卡路里": 38.0,
            "蛋白质": 0.76,
            "碳水化合物": 9.62,
            "脂肪": 0.04
        },
        "荔枝": {
            "卡路里": 71.0,
            "蛋白质": 0.9,
            "碳水化合物": 16.6,
            "脂肪": 0.2
        },
        "脐橙": {
            "卡路里": 49.0,
            "蛋白质": 0.91,
            "碳水化合物": 12.54,
            "脂肪": 0.15
        },
        "葡萄柚（白色）": {
            "卡路里": 33.0,
            "蛋白质": 0.69,
            "碳水化合物": 8.41,
            "脂肪": 0.1
        },
        "柠檬（不带皮）": {
            "卡路里": 29.0,
            "蛋白质": 1.1,
            "碳水化合物": 9.32,
            "脂肪": 0.3
        },
        "橙子": {
            "卡路里": 47.0,
            "蛋白质": 0.94,
            "碳水化合物": 11.75,
            "脂肪": 0.12
        },
        "金橘": {
            "卡路里": 71.0,
            "蛋白质": 1.88,
            "碳水化合物": 15.9,
            "脂肪": 0.86
        },
        "柠檬": {
            "卡路里": 37.0,
            "蛋白质": 1.1,
            "碳水化合物": 6.2,
            "脂肪": 1.2
        },
        "橘饼": {
            "卡路里": 371.0,
            "蛋白质": 0.6,
            "碳水化合物": 92.9,
            "脂肪": 0.4
        },
        "酸橙": {
            "卡路里": 30.0,
            "蛋白质": 0.7,
            "碳水化合物": 10.54,
            "脂肪": 0.2
        },
        "四川红橘": {
            "卡路里": 42.0,
            "蛋白质": 0.7,
            "碳水化合物": 9.8,
            "脂肪": 0.1
        },
        "小叶橘": {
            "卡路里": 40.0,
            "蛋白质": 1.1,
            "碳水化合物": 8.8,
            "脂肪": 0.2
        },
        "三湖红橘": {
            "卡路里": 43.0,
            "蛋白质": 0.8,
            "碳水化合物": 10.0,
            "脂肪": 0.3
        },
        "菠萝蜜": {
            "卡路里": 105.0,
            "蛋白质": 0.2,
            "碳水化合物": 25.7,
            "脂肪": 0.3
        },
        "芭蕉": {
            "卡路里": 115.0,
            "蛋白质": 1.2,
            "碳水化合物": 28.9,
            "脂肪": 0.1
        },
        "柑橘": {
            "卡路里": 57.0,
            "蛋白质": 0.4,
            "碳水化合物": 15.3,
            "脂肪": 0.1
        },
        "蜜橘": {
            "卡路里": 45.0,
            "蛋白质": 0.8,
            "碳水化合物": 10.3,
            "脂肪": 0.4
        },
        "柿子（美国）": {
            "卡路里": 127.0,
            "蛋白质": 0.8,
            "碳水化合物": 33.5,
            "脂肪": 0.4
        },
        "早橘": {
            "卡路里": 57.0,
            "蛋白质": 1.2,
            "碳水化合物": 12.6,
            "脂肪": 0.2
        },
        "芦柑": {
            "卡路里": 44.0,
            "蛋白质": 0.6,
            "碳水化合物": 10.3,
            "脂肪": 0.2
        },
        "葡萄（提子）": {
            "卡路里": 67.0,
            "蛋白质": 0.63,
            "碳水化合物": 17.15,
            "脂肪": 0.35
        },
        "柿饼": {
            "卡路里": 274.0,
            "蛋白质": 1.38,
            "碳水化合物": 73.43,
            "脂肪": 0.59
        },
        "柿子（日本）": {
            "卡路里": 70.0,
            "蛋白质": 0.58,
            "碳水化合物": 18.59,
            "脂肪": 0.19
        },
        "覆盆子（冷冻）": {
            "卡路里": 56.0,
            "蛋白质": 1.15,
            "碳水化合物": 12.55,
            "脂肪": 0.81
        },
        "橘柑子": {
            "卡路里": 44.0,
            "蛋白质": 0.8,
            "碳水化合物": 10.2,
            "脂肪": 0.1
        },
        "覆盆子（冷冻、加糖）": {
            "卡路里": 103.0,
            "蛋白质": 0.7,
            "碳水化合物": 26.16,
            "脂肪": 0.16
        },
        "葡萄干（黑色、无籽）": {
            "卡路里": 299.0,
            "蛋白质": 3.3,
            "碳水化合物": 79.32,
            "脂肪": 0.25
        },
        "草莓（冷冻）": {
            "卡路里": 35.0,
            "蛋白质": 0.43,
            "碳水化合物": 9.13,
            "脂肪": 0.11
        },
        "蓝莓（冷冻）": {
            "卡路里": 85.0,
            "蛋白质": 0.4,
            "碳水化合物": 21.95,
            "脂肪": 0.13
        },
        "柑橘（桔子）": {
            "卡路里": 51.0,
            "蛋白质": 0.7,
            "碳水化合物": 11.9,
            "脂肪": 0.2
        },
        "福橘": {
            "卡路里": 46.0,
            "蛋白质": 1.0,
            "碳水化合物": 10.3,
            "脂肪": 0.2
        },
        "草莓": {
            "卡路里": 32.0,
            "蛋白质": 0.67,
            "碳水化合物": 7.68,
            "脂肪": 0.3
        },
        "覆盆子": {
            "卡路里": 52.0,
            "蛋白质": 1.2,
            "碳水化合物": 11.94,
            "脂肪": 0.65
        },
        "蓝莓（罐头、浓糖浆）": {
            "卡路里": 88.0,
            "蛋白质": 0.65,
            "碳水化合物": 22.06,
            "脂肪": 0.33
        },
        "石榴": {
            "卡路里": 83.0,
            "蛋白质": 1.67,
            "碳水化合物": 18.7,
            "脂肪": 1.17
        },
        "桑葚": {
            "卡路里": 43.0,
            "蛋白质": 1.44,
            "碳水化合物": 9.8,
            "脂肪": 0.39
        },
        "猕猴桃": {
            "卡路里": 61.0,
            "蛋白质": 1.14,
            "碳水化合物": 14.66,
            "脂肪": 0.52
        },
        "黑莓": {
            "卡路里": 43.0,
            "蛋白质": 1.39,
            "碳水化合物": 9.61,
            "脂肪": 0.49
        },
        "中华猕猴桃": {
            "卡路里": 61.0,
            "蛋白质": 0.8,
            "碳水化合物": 14.5,
            "脂肪": 0.6
        },
        "无花果": {
            "卡路里": 65.0,
            "蛋白质": 1.5,
            "碳水化合物": 16.0,
            "脂肪": 0.1
        },
        "黑醋栗（黑加仑）": {
            "卡路里": 63.0,
            "蛋白质": 1.4,
            "碳水化合物": 15.4,
            "脂肪": 0.4
        },
        "沙棘": {
            "卡路里": 120.0,
            "蛋白质": 0.9,
            "碳水化合物": 25.5,
            "脂肪": 1.8
        },
        "葡萄干（金色、无籽）": {
            "卡路里": 301.0,
            "蛋白质": 3.28,
            "碳水化合物": 80.02,
            "脂肪": 0.2
        },
        "蔓越莓（干、甜）": {
            "卡路里": 308.0,
            "蛋白质": 0.17,
            "碳水化合物": 82.8,
            "脂肪": 1.09
        },
        "醋栗": {
            "卡路里": 44.0,
            "蛋白质": 0.88,
            "碳水化合物": 10.18,
            "脂肪": 0.58
        },
        "接骨木果": {
            "卡路里": 73.0,
            "蛋白质": 0.66,
            "碳水化合物": 18.4,
            "脂肪": 0.5
        },
        "蓝莓": {
            "卡路里": 57.0,
            "蛋白质": 0.74,
            "碳水化合物": 14.49,
            "脂肪": 0.33
        },
        "磨盘柿": {
            "卡路里": 79.0,
            "蛋白质": 0.7,
            "碳水化合物": 19.6,
            "脂肪": 0.1
        },
        "桑葚（白）": {
            "卡路里": 60.0,
            "蛋白质": 1.8,
            "碳水化合物": 14.9,
            "脂肪": 0.3
        },
        "桑葚（干）": {
            "卡路里": 298.0,
            "蛋白质": 21.1,
            "碳水化合物": 54.2,
            "脂肪": 6.1
        },
        "黑加仑": {
            "卡路里": 63.0,
            "蛋白质": 1.4,
            "碳水化合物": 15.38,
            "脂肪": 0.41
        },
        "柿子": {
            "卡路里": 74.0,
            "蛋白质": 0.4,
            "碳水化合物": 18.5,
            "脂肪": 0.1
        },
        "玫瑰香葡萄": {
            "卡路里": 52.0,
            "蛋白质": 0.4,
            "碳水化合物": 12.1,
            "脂肪": 0.4
        },
        "桑葚（红）": {
            "卡路里": 55.0,
            "蛋白质": 1.6,
            "碳水化合物": 12.9,
            "脂肪": 0.4
        },
        "红粉皮石榴": {
            "卡路里": 74.0,
            "蛋白质": 1.3,
            "碳水化合物": 19.4,
            "脂肪": 0.1
        },
        "荷柿": {
            "卡路里": 65.0,
            "蛋白质": 0.6,
            "碳水化合物": 17.1,
            "脂肪": 0.2
        },
        "石榴（均值）": {
            "卡路里": 73.0,
            "蛋白质": 1.4,
            "碳水化合物": 18.7,
            "脂肪": 0.2
        },
        "青皮石榴": {
            "卡路里": 71.0,
            "蛋白质": 1.2,
            "碳水化合物": 18.5,
            "脂肪": 0.2
        },
        "杏（脱水、硫化）": {
            "卡路里": 320.0,
            "蛋白质": 4.9,
            "碳水化合物": 82.89,
            "脂肪": 0.62
        },
        "葡萄干": {
            "卡路里": 344.0,
            "蛋白质": 2.5,
            "碳水化合物": 83.4,
            "脂肪": 0.4
        },
        "杏（罐头、水包装）": {
            "卡路里": 27.0,
            "蛋白质": 0.71,
            "碳水化合物": 6.39,
            "脂肪": 0.16
        },
        "杏子（冷冻、加糖）": {
            "卡路里": 98.0,
            "蛋白质": 0.7,
            "碳水化合物": 25.1,
            "脂肪": 0.1
        },
        "杏（罐头、浓糖浆）": {
            "卡路里": 83.0,
            "蛋白质": 0.53,
            "碳水化合物": 21.47,
            "脂肪": 0.08
        },
        "杏（干燥，硫化）": {
            "卡路里": 113.0,
            "蛋白质": 1.17,
            "碳水化合物": 29.26,
            "脂肪": 0.15
        },
        "桃子（罐装、浓糖浆）": {
            "卡路里": 74.0,
            "蛋白质": 0.45,
            "碳水化合物": 19.94,
            "脂肪": 0.1
        },
        "李子干（炖煮、不加糖）": {
            "卡路里": 107.0,
            "蛋白质": 0.96,
            "碳水化合物": 28.08,
            "脂肪": 0.16
        },
        "葡萄": {
            "卡路里": 44.0,
            "蛋白质": 0.5,
            "碳水化合物": 10.3,
            "脂肪": 0.2
        },
        "桃（罐头、浓糖浆）": {
            "卡路里": 72.0,
            "蛋白质": 0.52,
            "碳水化合物": 18.43,
            "脂肪": 0.18
        },
        "巨峰葡萄": {
            "卡路里": 51.0,
            "蛋白质": 0.4,
            "碳水化合物": 12.0,
            "脂肪": 0.2
        },
        "杏（干燥、硫化）": {
            "卡路里": 241.0,
            "蛋白质": 3.39,
            "碳水化合物": 62.64,
            "脂肪": 0.51
        },
        "桃子（黄色）": {
            "卡路里": 39.0,
            "蛋白质": 0.91,
            "碳水化合物": 9.54,
            "脂肪": 0.25
        },
        "杏（脱水）": {
            "卡路里": 126.0,
            "蛋白质": 1.93,
            "碳水化合物": 32.62,
            "脂肪": 0.24
        },
        "紫葡萄": {
            "卡路里": 45.0,
            "蛋白质": 0.7,
            "碳水化合物": 10.3,
            "脂肪": 0.3
        },
        "红玫瑰葡萄": {
            "卡路里": 42.0,
            "蛋白质": 0.4,
            "碳水化合物": 10.7,
            "脂肪": 0.2
        },
        "橄榄（罐装）": {
            "卡路里": 116.0,
            "蛋白质": 0.84,
            "碳水化合物": 6.04,
            "脂肪": 10.9
        },
        "桃子（婴儿食品）": {
            "卡路里": 65.0,
            "蛋白质": 0.94,
            "碳水化合物": 14.48,
            "脂肪": 0.33
        },
        "橄榄（腌渍、罐装）": {
            "卡路里": 145.0,
            "蛋白质": 1.03,
            "碳水化合物": 3.84,
            "脂肪": 15.32
        },
        "李子": {
            "卡路里": 46.0,
            "蛋白质": 0.7,
            "碳水化合物": 11.42,
            "脂肪": 0.28
        },
        "枣": {
            "卡路里": 79.0,
            "蛋白质": 1.2,
            "碳水化合物": 20.23,
            "脂肪": 0.2
        },
        "油桃": {
            "卡路里": 44.0,
            "蛋白质": 1.06,
            "碳水化合物": 10.55,
            "脂肪": 0.32
        },
        "樱桃（甜）": {
            "卡路里": 63.0,
            "蛋白质": 1.06,
            "碳水化合物": 16.01,
            "脂肪": 0.2
        },
        "释迦凤梨": {
            "卡路里": 101.0,
            "蛋白质": 1.7,
            "碳水化合物": 25.2,
            "脂肪": 0.6
        },
        "杏子（罐头、不带皮）": {
            "卡路里": 22.0,
            "蛋白质": 0.69,
            "碳水化合物": 5.48,
            "脂肪": 0.03
        },
        "苏里南樱桃": {
            "卡路里": 33.0,
            "蛋白质": 0.8,
            "碳水化合物": 7.49,
            "脂肪": 0.4
        },
        "李子干": {
            "卡路里": 240.0,
            "蛋白质": 2.18,
            "碳水化合物": 63.88,
            "脂肪": 0.38
        },
        "杏（罐头、轻糖浆）": {
            "卡路里": 63.0,
            "蛋白质": 0.53,
            "碳水化合物": 16.49,
            "脂肪": 0.05
        },
        "杏子": {
            "卡路里": 48.0,
            "蛋白质": 1.4,
            "碳水化合物": 11.12,
            "脂肪": 0.39
        },
        "樱桃（酸、红）": {
            "卡路里": 50.0,
            "蛋白质": 1.0,
            "碳水化合物": 12.18,
            "脂肪": 0.3
        },
        "针叶樱桃": {
            "卡路里": 32.0,
            "蛋白质": 0.4,
            "碳水化合物": 7.69,
            "脂肪": 0.3
        },
        "樱桃（酸、红、冷冻）": {
            "卡路里": 46.0,
            "蛋白质": 0.92,
            "碳水化合物": 11.02,
            "脂肪": 0.44
        },
        "樱桃（野、白刺）": {
            "卡路里": 304.0,
            "蛋白质": 11.4,
            "碳水化合物": 59.8,
            "脂肪": 3.9
        },
        "蜜枣（无核）": {
            "卡路里": 327.0,
            "蛋白质": 1.0,
            "碳水化合物": 81.9,
            "脂肪": 0.1
        },
        "蜜枣": {
            "卡路里": 333.0,
            "蛋白质": 1.3,
            "碳水化合物": 84.4,
            "脂肪": 0.2
        },
        "酒枣": {
            "卡路里": 148.0,
            "蛋白质": 1.6,
            "碳水化合物": 35.7,
            "脂肪": 0.2
        },
        "黑枣（无核）": {
            "卡路里": 234.0,
            "蛋白质": 1.7,
            "碳水化合物": 57.3,
            "脂肪": 0.3
        },
        "黑枣": {
            "卡路里": 247.0,
            "蛋白质": 3.7,
            "碳水化合物": 61.4,
            "脂肪": 0.5
        },
        "乐陵枣": {
            "卡路里": 233.0,
            "蛋白质": 3.3,
            "碳水化合物": 57.9,
            "脂肪": 0.6
        },
        "酸枣": {
            "卡路里": 300.0,
            "蛋白质": 3.5,
            "碳水化合物": 73.3,
            "脂肪": 1.5
        },
        "密云小枣": {
            "卡路里": 229.0,
            "蛋白质": 3.9,
            "碳水化合物": 55.2,
            "脂肪": 0.8
        },
        "杏干": {
            "卡路里": 338.0,
            "蛋白质": 2.7,
            "碳水化合物": 83.2,
            "脂肪": 0.4
        },
        "金丝小枣": {
            "卡路里": 308.0,
            "蛋白质": 1.2,
            "碳水化合物": 76.7,
            "脂肪": 1.1
        },
        "枣（干）": {
            "卡路里": 276.0,
            "蛋白质": 3.2,
            "碳水化合物": 67.8,
            "脂肪": 0.5
        },
        "李子杏": {
            "卡路里": 37.0,
            "蛋白质": 1.0,
            "碳水化合物": 8.6,
            "脂肪": 0.1
        },
        "早桃": {
            "卡路里": 41.0,
            "蛋白质": 0.4,
            "碳水化合物": 10.1,
            "脂肪": 0.1
        },
        "晚桃": {
            "卡路里": 41.0,
            "蛋白质": 0.7,
            "碳水化合物": 9.6,
            "脂肪": 0.2
        },
        "庆丰桃": {
            "卡路里": 42.0,
            "蛋白质": 0.6,
            "碳水化合物": 10.1,
            "脂肪": 0.1
        },
        "樱桃": {
            "卡路里": 46.0,
            "蛋白质": 1.1,
            "碳水化合物": 10.2,
            "脂肪": 0.2
        },
        "蒲桃": {
            "卡路里": 39.0,
            "蛋白质": 0.5,
            "碳水化合物": 10.2,
            "脂肪": 0.2
        },
        "枣（干、大）": {
            "卡路里": 317.0,
            "蛋白质": 2.1,
            "碳水化合物": 81.1,
            "脂肪": 0.4
        },
        "蜜桃（水蜜桃）": {
            "卡路里": 43.0,
            "蛋白质": 0.9,
            "碳水化合物": 9.8,
            "脂肪": 0.2
        },
        "旱久保桃": {
            "卡路里": 48.0,
            "蛋白质": 0.9,
            "碳水化合物": 11.3,
            "脂肪": 0.1
        },
        "高山白桃": {
            "卡路里": 42.0,
            "蛋白质": 0.7,
            "碳水化合物": 10.1,
            "脂肪": 0.2
        },
        "久保桃": {
            "卡路里": 42.0,
            "蛋白质": 0.6,
            "碳水化合物": 10.0,
            "脂肪": 0.1
        },
        "桃": {
            "卡路里": 51.0,
            "蛋白质": 0.9,
            "碳水化合物": 12.2,
            "脂肪": 0.1
        },
        "鳄梨": {
            "卡路里": 167.0,
            "蛋白质": 1.96,
            "碳水化合物": 8.64,
            "脂肪": 15.41
        },
        "苹果（脱水）": {
            "卡路里": 346.0,
            "蛋白质": 1.32,
            "碳水化合物": 93.53,
            "脂肪": 0.58
        },
        "苹果（干燥）": {
            "卡路里": 83.0,
            "蛋白质": 0.2,
            "碳水化合物": 20.73,
            "脂肪": 0.07
        },
        "梨": {
            "卡路里": 57.0,
            "蛋白质": 0.36,
            "碳水化合物": 15.23,
            "脂肪": 0.14
        },
        "牛油果": {
            "卡路里": 160.0,
            "蛋白质": 2.0,
            "碳水化合物": 8.53,
            "脂肪": 14.66
        },
        "苹果（罐头）": {
            "卡路里": 67.0,
            "蛋白质": 0.18,
            "碳水化合物": 16.84,
            "脂肪": 0.43
        },
        "红星苹果": {
            "卡路里": 59.0,
            "蛋白质": 0.27,
            "碳水化合物": 14.06,
            "脂肪": 0.2
        },
        "苹果（不带皮）": {
            "卡路里": 48.0,
            "蛋白质": 0.27,
            "碳水化合物": 12.76,
            "脂肪": 0.13
        },
        "梨（婴儿食品）": {
            "卡路里": 42.0,
            "蛋白质": 0.3,
            "碳水化合物": 10.8,
            "脂肪": 0.2
        },
        "红安茹梨": {
            "卡路里": 62.0,
            "蛋白质": 0.33,
            "碳水化合物": 14.94,
            "脂肪": 0.14
        }
    },
    "奶类": {
        "全脂牛奶": {
            "卡路里": 61.0,
            "蛋白质": 3.2,
            "碳水化合物": 4.8,
            "脂肪": 3.3
        },
        "脱脂牛奶": {
            "卡路里": 34.0,
            "蛋白质": 3.4,
            "碳水化合物": 4.9,
            "脂肪": 0.1
        },
        "酸奶（原味）": {
            "卡路里": 59.0,
            "蛋白质": 3.5,
            "碳水化合物": 4.7,
            "脂肪": 3.3
        },
        "奶酪（切达）": {
            "卡路里": 403.0,
            "蛋白质": 24.9,
            "碳水化合物": 1.3,
            "脂肪": 33.1
        },
        "奶粉（全脂）": {
            "卡路里": 496.0,
            "蛋白质": 26.3,
            "碳水化合物": 38.4,
            "脂肪": 26.7
        }
    },
    "油脂": {
        "橄榄油": {
            "卡路里": 884.0,
            "蛋白质": 0.0,
            "碳水化合物": 0.0,
            "脂肪": 100.0
        },
        "花生油": {
            "卡路里": 884.0,
            "蛋白质": 0.0,
            "碳水化合物": 0.0,
            "脂肪": 100.0
        },
        "黄油": {
            "卡路里": 717.0,
            "蛋白质": 0.9,
            "碳水化合物": 0.1,
            "脂肪": 81.1
        },
        "椰子油": {
            "卡路里": 862.0,
            "蛋白质": 0.0,
            "碳水化合物": 0.0,
            "脂肪": 100.0
        },
        "芝麻油": {
            "卡路里": 884.0,
            "蛋白质": 0.0,
            "碳水化合物": 0.0,
            "脂肪": 100.0
        }
    },
    "坚果": {
        "杏仁": {
            "卡路里": 579.0,
            "蛋白质": 21.2,
            "碳水化合物": 21.7,
            "脂肪": 49.9
        },
        "核桃": {
            "卡路里": 654.0,
            "蛋白质": 15.2,
            "碳水化合物": 13.7,
            "脂肪": 65.2
        },
        "花生": {
            "卡路里": 567.0,
            "蛋白质": 25.8,
            "碳水化合物": 16.1,
            "脂肪": 49.2
        },
        "腰果": {
            "卡路里": 553.0,
            "蛋白质": 18.2,
            "碳水化合物": 30.2,
            "脂肪": 43.8
        },
        "开心果": {
            "卡路里": 562.0,
            "蛋白质": 20.2,
            "碳水化合物": 27.5,
            "脂肪": 45.4
        }
    },
    "调料": {
        "鸡精": {
            "卡路里": 267.0,
            "蛋白质": 16.66,
            "碳水化合物": 18.01,
            "脂肪": 13.88
        },
        "鸡精（用水配制）": {
            "卡路里": 4.0,
            "蛋白质": 0.28,
            "碳水化合物": 0.3,
            "脂肪": 0.23
        },
        "鼠尾草": {
            "卡路里": 315.0,
            "蛋白质": 10.63,
            "碳水化合物": 60.73,
            "脂肪": 12.75
        },
        "汤（拉面、牛肉味、干）": {
            "卡路里": 441.0,
            "蛋白质": 10.06,
            "碳水化合物": 60.34,
            "脂肪": 17.73
        },
        "湖盐（青盐）": {
            "卡路里": 11.0,
            "蛋白质": 0.1,
            "碳水化合物": 2.7,
            "脂肪": 0
        },
        "胡芦巴籽": {
            "卡路里": 323.0,
            "蛋白质": 23.0,
            "碳水化合物": 58.35,
            "脂肪": 6.41
        },
        "汤（拉面、鸡肉味、干）": {
            "卡路里": 439.0,
            "蛋白质": 10.22,
            "碳水化合物": 60.23,
            "脂肪": 17.52
        },
        "酵母（鲜）": {
            "卡路里": 106.0,
            "蛋白质": 2.6,
            "碳水化合物": 23.9,
            "脂肪": 1.9
        },
        "姜黄粉": {
            "卡路里": 312.0,
            "蛋白质": 9.68,
            "碳水化合物": 67.14,
            "脂肪": 3.25
        },
        "酵母（干）": {
            "卡路里": 372.0,
            "蛋白质": 47.6,
            "碳水化合物": 45.5,
            "脂肪": 1.7
        },
        "味精": {
            "卡路里": 268.0,
            "蛋白质": 40.1,
            "碳水化合物": 26.5,
            "脂肪": 0.2
        },
        "牛至（脱水）": {
            "卡路里": 265.0,
            "蛋白质": 9.0,
            "碳水化合物": 68.92,
            "脂肪": 4.28
        },
        "洋葱粉": {
            "卡路里": 341.0,
            "蛋白质": 10.41,
            "碳水化合物": 79.12,
            "脂肪": 1.04
        },
        "芥末": {
            "卡路里": 508.0,
            "蛋白质": 26.08,
            "碳水化合物": 28.09,
            "脂肪": 36.24
        },
        "胡椒粉（黑色）": {
            "卡路里": 251.0,
            "蛋白质": 10.39,
            "碳水化合物": 63.95,
            "脂肪": 3.26
        },
        "姜粉": {
            "卡路里": 335.0,
            "蛋白质": 8.98,
            "碳水化合物": 71.62,
            "脂肪": 4.24
        },
        "藏红花": {
            "卡路里": 310.0,
            "蛋白质": 11.43,
            "碳水化合物": 65.37,
            "脂肪": 5.85
        },
        "百里香": {
            "卡路里": 101.0,
            "蛋白质": 5.56,
            "碳水化合物": 24.45,
            "脂肪": 1.68
        },
        "大蒜粉": {
            "卡路里": 331.0,
            "蛋白质": 16.55,
            "碳水化合物": 72.73,
            "脂肪": 0.73
        },
        "肉桂": {
            "卡路里": 247.0,
            "蛋白质": 3.99,
            "碳水化合物": 80.59,
            "脂肪": 1.24
        },
        "迷迭香": {
            "卡路里": 131.0,
            "蛋白质": 3.31,
            "碳水化合物": 20.7,
            "脂肪": 5.86
        },
        "薄荷": {
            "卡路里": 70.0,
            "蛋白质": 3.75,
            "碳水化合物": 14.89,
            "脂肪": 0.94
        },
        "罗勒（脱水）": {
            "卡路里": 233.0,
            "蛋白质": 22.98,
            "碳水化合物": 47.75,
            "脂肪": 4.07
        },
        "莳萝": {
            "卡路里": 43.0,
            "蛋白质": 3.46,
            "碳水化合物": 7.02,
            "脂肪": 1.12
        },
        "马郁兰（脱水）": {
            "卡路里": 271.0,
            "蛋白质": 12.66,
            "碳水化合物": 60.56,
            "脂肪": 7.04
        },
        "辣椒粉": {
            "卡路里": 282.0,
            "蛋白质": 13.46,
            "碳水化合物": 49.7,
            "脂肪": 14.28
        },
        "丁香粉": {
            "卡路里": 274.0,
            "蛋白质": 5.97,
            "碳水化合物": 65.53,
            "脂肪": 13.0
        },
        "刺山柑（罐头）": {
            "卡路里": 23.0,
            "蛋白质": 2.36,
            "碳水化合物": 4.89,
            "脂肪": 0.86
        },
        "八角（大料）": {
            "卡路里": 281.0,
            "蛋白质": 3.8,
            "碳水化合物": 75.4,
            "脂肪": 5.6
        },
        "茴香籽": {
            "卡路里": 318.0,
            "蛋白质": 14.5,
            "碳水化合物": 55.5,
            "脂肪": 11.8
        },
        "苦豆子": {
            "卡路里": 270.0,
            "蛋白质": 4.6,
            "碳水化合物": 72.3,
            "脂肪": 2.4
        },
        "芹菜籽": {
            "卡路里": 392.0,
            "蛋白质": 18.07,
            "碳水化合物": 41.35,
            "脂肪": 25.27
        },
        "胡椒粉": {
            "卡路里": 361.0,
            "蛋白质": 9.6,
            "碳水化合物": 76.9,
            "脂肪": 2.2
        },
        "全料蒸肉粉": {
            "卡路里": 343.0,
            "蛋白质": 8.9,
            "碳水化合物": 74.3,
            "脂肪": 1.2
        },
        "黄毛籽": {
            "卡路里": 330.0,
            "蛋白质": 21.0,
            "碳水化合物": 50.4,
            "脂肪": 15.6
        },
        "咖喱粉": {
            "卡路里": 325.0,
            "蛋白质": 14.29,
            "碳水化合物": 55.83,
            "脂肪": 14.01
        },
        "腌雪里红": {
            "卡路里": 29.0,
            "蛋白质": 2.4,
            "碳水化合物": 5.4,
            "脂肪": 0.2
        },
        "五香粉": {
            "卡路里": 359.0,
            "蛋白质": 1.0,
            "碳水化合物": 73.3,
            "脂肪": 8.0
        },
        "罂粟籽": {
            "卡路里": 525.0,
            "蛋白质": 17.99,
            "碳水化合物": 28.13,
            "脂肪": 41.56
        },
        "花椒": {
            "卡路里": 316.0,
            "蛋白质": 6.7,
            "碳水化合物": 66.5,
            "脂肪": 8.9
        },
        "榨菜": {
            "卡路里": 33.0,
            "蛋白质": 2.2,
            "碳水化合物": 6.5,
            "脂肪": 0.3
        },
        "蒜头（酱）": {
            "卡路里": 109.0,
            "蛋白质": 4.4,
            "碳水化合物": 23.9,
            "脂肪": 0.1
        },
        "腌芥菜头": {
            "卡路里": 44.0,
            "蛋白质": 2.8,
            "碳水化合物": 9.3,
            "脂肪": 0.1
        },
        "糖蒜（甜蒜头）": {
            "卡路里": 117.0,
            "蛋白质": 2.1,
            "碳水化合物": 27.6,
            "脂肪": 0.2
        },
        "蕨菜（腌）": {
            "卡路里": 26.0,
            "蛋白质": 2.5,
            "碳水化合物": 4.4,
            "脂肪": 0.3
        },
        "辣萝卜条": {
            "卡路里": 41.0,
            "蛋白质": 1.4,
            "碳水化合物": 8.5,
            "脂肪": 0.5
        },
        "腌龙须菜": {
            "卡路里": 71.0,
            "蛋白质": 1.4,
            "碳水化合物": 17.3,
            "脂肪": 0
        },
        "洋姜（腌）": {
            "卡路里": 36.0,
            "蛋白质": 2.6,
            "碳水化合物": 6.8,
            "脂肪": 0
        },
        "金钱萝卜": {
            "卡路里": 45.0,
            "蛋白质": 1.6,
            "碳水化合物": 10.1,
            "脂肪": 0.3
        },
        "萝卜干": {
            "卡路里": 67.0,
            "蛋白质": 3.3,
            "碳水化合物": 14.6,
            "脂肪": 0.2
        },
        "腐乳": {
            "卡路里": 116.0,
            "蛋白质": 8.92,
            "碳水化合物": 4.38,
            "脂肪": 8.0
        },
        "乳黄瓜（嫩黄瓜）": {
            "卡路里": 36.0,
            "蛋白质": 1.7,
            "碳水化合物": 7.4,
            "脂肪": 0.3
        },
        "酱蘑菇": {
            "卡路里": 122.0,
            "蛋白质": 5.4,
            "碳水化合物": 25.0,
            "脂肪": 0.2
        },
        "酱莴笋": {
            "卡路里": 25.0,
            "蛋白质": 2.3,
            "碳水化合物": 4.1,
            "脂肪": 0.2
        },
        "腐乳（白）": {
            "卡路里": 135.0,
            "蛋白质": 10.9,
            "碳水化合物": 4.8,
            "脂肪": 8.2
        },
        "酱大头菜": {
            "卡路里": 41.0,
            "蛋白质": 2.4,
            "碳水化合物": 8.4,
            "脂肪": 0.3
        },
        "酱萝卜": {
            "卡路里": 33.0,
            "蛋白质": 3.5,
            "碳水化合物": 4.5,
            "脂肪": 0.4
        },
        "腐乳（红）": {
            "卡路里": 153.0,
            "蛋白质": 12.0,
            "碳水化合物": 8.2,
            "脂肪": 8.1
        },
        "腐乳（臭）": {
            "卡路里": 132.0,
            "蛋白质": 11.6,
            "碳水化合物": 3.9,
            "脂肪": 7.9
        },
        "桂林腐乳": {
            "卡路里": 206.0,
            "蛋白质": 7.3,
            "碳水化合物": 19.2,
            "脂肪": 11.3
        },
        "芥菜干": {
            "卡路里": 196.0,
            "蛋白质": 13.3,
            "碳水化合物": 47.5,
            "脂肪": 0.8
        },
        "苹果酱（罐头、不加糖）": {
            "卡路里": 42.0,
            "蛋白质": 0.17,
            "碳水化合物": 11.27,
            "脂肪": 0.1
        },
        "蛋黄酱": {
            "卡路里": 238.0,
            "蛋白质": 0.37,
            "碳水化合物": 9.23,
            "脂肪": 22.22
        },
        "酱黄瓜": {
            "卡路里": 26.0,
            "蛋白质": 3.0,
            "碳水化合物": 3.4,
            "脂肪": 0.3
        },
        "苹果酱（罐头、加糖）": {
            "卡路里": 76.0,
            "蛋白质": 0.18,
            "碳水化合物": 19.91,
            "脂肪": 0.18
        },
        "姜（糟）": {
            "卡路里": 30.0,
            "蛋白质": 1.6,
            "碳水化合物": 4.8,
            "脂肪": 0.8
        },
        "冬菜": {
            "卡路里": 52.0,
            "蛋白质": 3.5,
            "碳水化合物": 10.1,
            "脂肪": 0.3
        },
        "味噌": {
            "卡路里": 198.0,
            "蛋白质": 12.79,
            "碳水化合物": 25.37,
            "脂肪": 6.01
        },
        "辣牛肉酱与豆（罐装主菜）": {
            "卡路里": 107.0,
            "蛋白质": 5.8,
            "碳水化合物": 13.1,
            "脂肪": 3.47
        },
        "花生酱": {
            "卡路里": 598.0,
            "蛋白质": 22.21,
            "碳水化合物": 22.31,
            "脂肪": 51.36
        },
        "菜豆泥（红色、罐装）": {
            "卡路里": 144.0,
            "蛋白质": 5.0,
            "碳水化合物": 15.47,
            "脂肪": 6.93
        },
        "伍斯特郡酱": {
            "卡路里": 77.0,
            "蛋白质": 0,
            "碳水化合物": 19.17,
            "脂肪": 0
        },
        "海鲜酱汁": {
            "卡路里": 220.0,
            "蛋白质": 3.31,
            "碳水化合物": 44.08,
            "脂肪": 3.39
        },
        "蛋黄酱（用豆腐做成）": {
            "卡路里": 322.0,
            "蛋白质": 5.95,
            "碳水化合物": 3.06,
            "脂肪": 31.79
        },
        "火鸡肉汁（罐装）": {
            "卡路里": 51.0,
            "蛋白质": 2.6,
            "碳水化合物": 5.1,
            "脂肪": 2.1
        },
        "苹果酱（婴儿食品）": {
            "卡路里": 41.0,
            "蛋白质": 0.2,
            "碳水化合物": 10.8,
            "脂肪": 0.2
        },
        "汤（鸡精奶油、罐头、浓缩）": {
            "卡路里": 90.0,
            "蛋白质": 2.38,
            "碳水化合物": 7.16,
            "脂肪": 5.77
        },
        "番茄酱（罐头）": {
            "卡路里": 38.0,
            "蛋白质": 1.65,
            "碳水化合物": 8.98,
            "脂肪": 0.21
        },
        "花生酱（减少脂肪）": {
            "卡路里": 520.0,
            "蛋白质": 25.9,
            "碳水化合物": 35.65,
            "脂肪": 34.0
        },
        "蔬菜汁餐前开胃菜（罐头）": {
            "卡路里": 22.0,
            "蛋白质": 0.93,
            "碳水化合物": 3.87,
            "脂肪": 0.31
        },
        "番茄酱": {
            "卡路里": 85.0,
            "蛋白质": 4.9,
            "碳水化合物": 16.9,
            "脂肪": 0.2
        },
        "番茄汁（罐装）": {
            "卡路里": 17.0,
            "蛋白质": 0.85,
            "碳水化合物": 3.53,
            "脂肪": 0.29
        },
        "汤（番茄、罐头、浓缩）": {
            "卡路里": 66.0,
            "蛋白质": 1.46,
            "碳水化合物": 15.22,
            "脂肪": 0.44
        },
        "蔓越莓酱（罐头）": {
            "卡路里": 159.0,
            "蛋白质": 0.9,
            "碳水化合物": 40.4,
            "脂肪": 0.15
        },
        "草莓酱": {
            "卡路里": 270.0,
            "蛋白质": 0.8,
            "碳水化合物": 66.3,
            "脂肪": 0.2
        },
        "辣椒酱": {
            "卡路里": 36.0,
            "蛋白质": 0.8,
            "碳水化合物": 3.2,
            "脂肪": 2.8
        },
        "酱汁（意大利面条/海员式沙司）": {
            "卡路里": 50.0,
            "蛋白质": 1.39,
            "碳水化合物": 7.43,
            "脂肪": 1.61
        },
        "芝麻酱": {
            "卡路里": 630.0,
            "蛋白质": 19.2,
            "碳水化合物": 22.7,
            "脂肪": 52.7
        },
        "杏酱": {
            "卡路里": 286.0,
            "蛋白质": 0.2,
            "碳水化合物": 70.9,
            "脂肪": 0.3
        },
        "鹰嘴豆泥": {
            "卡路里": 237.0,
            "蛋白质": 7.78,
            "碳水化合物": 15.0,
            "脂肪": 17.82
        },
        "甜面酱": {
            "卡路里": 139.0,
            "蛋白质": 5.5,
            "碳水化合物": 28.5,
            "脂肪": 0.6
        },
        "蒜蓉辣酱": {
            "卡路里": 96.0,
            "蛋白质": 4.8,
            "碳水化合物": 19.6,
            "脂肪": 0.6
        },
        "香醋": {
            "卡路里": 68.0,
            "蛋白质": 3.8,
            "碳水化合物": 13.0,
            "脂肪": 0.1
        },
        "黑醋": {
            "卡路里": 91.0,
            "蛋白质": 3.7,
            "碳水化合物": 18.5,
            "脂肪": 0.2
        },
        "酱油膏": {
            "卡路里": 99.0,
            "蛋白质": 13.0,
            "碳水化合物": 10.2,
            "脂肪": 0.7
        },
        "豆瓣辣酱": {
            "卡路里": 73.0,
            "蛋白质": 3.6,
            "碳水化合物": 12.9,
            "脂肪": 2.4
        },
        "五香豆豉": {
            "卡路里": 270.0,
            "蛋白质": 24.1,
            "碳水化合物": 39.7,
            "脂肪": 3.0
        },
        "白醋": {
            "卡路里": 6.0,
            "蛋白质": 0.1,
            "碳水化合物": 0,
            "脂肪": 0.6
        },
        "酱油（大豆和小麦）": {
            "卡路里": 53.0,
            "蛋白质": 8.14,
            "碳水化合物": 4.93,
            "脂肪": 0.57
        },
        "豆瓣酱": {
            "卡路里": 181.0,
            "蛋白质": 13.6,
            "碳水化合物": 17.1,
            "脂肪": 6.8
        },
        "陈醋": {
            "卡路里": 114.0,
            "蛋白质": 9.8,
            "碳水化合物": 17.9,
            "脂肪": 0.3
        },
        "醋": {
            "卡路里": 31.0,
            "蛋白质": 2.1,
            "碳水化合物": 4.9,
            "脂肪": 0.3
        },
        "酱油": {
            "卡路里": 60.0,
            "蛋白质": 7.0,
            "碳水化合物": 7.84,
            "脂肪": 0.51
        },
        "酱油（一级）": {
            "卡路里": 66.0,
            "蛋白质": 8.3,
            "碳水化合物": 6.9,
            "脂肪": 0.6
        },
        "黄酱（大酱）": {
            "卡路里": 138.0,
            "蛋白质": 12.1,
            "碳水化合物": 21.3,
            "脂肪": 1.2
        },
        "酱油（三级）": {
            "卡路里": 40.0,
            "蛋白质": 6.8,
            "碳水化合物": 2.4,
            "脂肪": 0.4
        }
    },
    "饮品": {
        "香雪酒": {
            "卡路里": 37.0,
            "蛋白质": 1.5,
            "碳水化合物": 0,
            "脂肪": 0
        },
        "蔓越莓汁鸡尾酒（冷冻浓缩物）": {
            "卡路里": 47.0,
            "蛋白质": 0.01,
            "碳水化合物": 11.81,
            "脂肪": 0
        },
        "葡萄酒（佐餐酒、红色、桑娇维塞）": {
            "卡路里": 86.0,
            "蛋白质": 0.07,
            "碳水化合物": 2.62,
            "脂肪": 0
        },
        "葡萄酒（佐餐酒、红色、黑比诺）": {
            "卡路里": 82.0,
            "蛋白质": 0.07,
            "碳水化合物": 2.31,
            "脂肪": 0
        },
        "蔓越莓汁鸡尾酒": {
            "卡路里": 54.0,
            "蛋白质": 0,
            "碳水化合物": 13.52,
            "脂肪": 0.1
        },
        "二锅头": {
            "卡路里": 351.0,
            "蛋白质": 0,
            "碳水化合物": 0,
            "脂肪": 0
        },
        "葡萄酒（佐餐酒、白色）": {
            "卡路里": 82.0,
            "蛋白质": 0.07,
            "碳水化合物": 2.6,
            "脂肪": 0
        },
        "葡萄酒（佐餐酒、红色、梅洛）": {
            "卡路里": 83.0,
            "蛋白质": 0.07,
            "碳水化合物": 2.51,
            "脂肪": 0
        },
        "珠茶": {
            "卡路里": 334.0,
            "蛋白质": 28.7,
            "碳水化合物": 58.3,
            "脂肪": 1.7
        },
        "铁观音茶": {
            "卡路里": 334.0,
            "蛋白质": 22.8,
            "碳水化合物": 65.0,
            "脂肪": 1.3
        },
        "茶砖（砖茶）": {
            "卡路里": 283.0,
            "蛋白质": 14.5,
            "碳水化合物": 66.7,
            "脂肪": 4.0
        },
        "龙井茶": {
            "卡路里": 331.0,
            "蛋白质": 33.3,
            "碳水化合物": 48.9,
            "脂肪": 2.7
        },
        "红茶": {
            "卡路里": 324.0,
            "蛋白质": 26.7,
            "碳水化合物": 59.2,
            "脂肪": 1.1
        },
        "花茶": {
            "卡路里": 316.0,
            "蛋白质": 27.1,
            "碳水化合物": 58.1,
            "脂肪": 1.2
        },
        "石榴花茶": {
            "卡路里": 343.0,
            "蛋白质": 10.5,
            "碳水化合物": 74.2,
            "脂肪": 2.9
        },
        "绿茶": {
            "卡路里": 328.0,
            "蛋白质": 34.2,
            "碳水化合物": 50.3,
            "脂肪": 2.3
        }
    },
    "零食": {
        "大豆蛋白粉": {
            "卡路里": 388.0,
            "蛋白质": 55.56,
            "碳水化合物": 28.89,
            "脂肪": 5.56
        },
        "橙汁饮料（冷冻浓缩物）": {
            "卡路里": 153.0,
            "蛋白质": 0.4,
            "碳水化合物": 39.0,
            "脂肪": 0
        },
        "百事可乐（佳得乐）": {
            "卡路里": 8.0,
            "蛋白质": 0.05,
            "碳水化合物": 1.94,
            "脂肪": 0.01
        },
        "麦芽饮料混合物": {
            "卡路里": 88.0,
            "蛋白质": 3.86,
            "碳水化合物": 10.23,
            "脂肪": 3.62
        },
        "蜂蜜": {
            "卡路里": 304.0,
            "蛋白质": 0.3,
            "碳水化合物": 82.4,
            "脂肪": 0
        },
        "麦芽饮料混合物（巧克力）": {
            "卡路里": 85.0,
            "蛋白质": 3.37,
            "碳水化合物": 11.2,
            "脂肪": 3.29
        },
        "奶昔（草莓）": {
            "卡路里": 113.0,
            "蛋白质": 3.4,
            "碳水化合物": 18.9,
            "脂肪": 2.8
        },
        "苹果汁": {
            "卡路里": 46.0,
            "蛋白质": 0.1,
            "碳水化合物": 11.3,
            "脂肪": 0.13
        },
        "红牛": {
            "卡路里": 43.0,
            "蛋白质": 0.46,
            "碳水化合物": 10.23,
            "脂肪": 0
        },
        "果味饮料（低卡路里）": {
            "卡路里": 218.0,
            "蛋白质": 0.45,
            "碳水化合物": 87.38,
            "脂肪": 0.04
        },
        "咖啡（速溶、无咖啡因）": {
            "卡路里": 351.0,
            "蛋白质": 11.6,
            "碳水化合物": 76.0,
            "脂肪": 0.2
        },
        "咖啡（速溶）": {
            "卡路里": 353.0,
            "蛋白质": 12.2,
            "碳水化合物": 75.4,
            "脂肪": 0.5
        },
        "苹果汁（冷冻浓缩物）": {
            "卡路里": 166.0,
            "蛋白质": 0.51,
            "碳水化合物": 41.0,
            "脂肪": 0.37
        },
        "杏仁牛奶（巧克力）": {
            "卡路里": 50.0,
            "蛋白质": 0.63,
            "碳水化合物": 9.38,
            "脂肪": 1.25
        },
        "针叶樱桃汁": {
            "卡路里": 23.0,
            "蛋白质": 0.4,
            "碳水化合物": 4.8,
            "脂肪": 0.3
        },
        "雅培（ENSURE PLUS、即饮型）": {
            "卡路里": 141.0,
            "蛋白质": 5.16,
            "碳水化合物": 19.88,
            "脂肪": 4.52
        },
        "麦芽混合饮料粉（巧克力）": {
            "卡路里": 411.0,
            "蛋白质": 5.1,
            "碳水化合物": 86.94,
            "脂肪": 4.76
        },
        "可可粉": {
            "卡路里": 220.0,
            "蛋白质": 18.1,
            "碳水化合物": 58.3,
            "脂肪": 13.1
        },
        "茶（绿色）": {
            "卡路里": 1.0,
            "蛋白质": 0.22,
            "碳水化合物": 0,
            "脂肪": 0
        },
        "葡萄汁（婴儿食品）": {
            "卡路里": 62.0,
            "蛋白质": 0,
            "碳水化合物": 15.38,
            "脂肪": 0
        },
        "梨汁（婴儿食品）": {
            "卡路里": 43.0,
            "蛋白质": 0,
            "碳水化合物": 11.86,
            "脂肪": 0
        },
        "葡萄柚汁（白色、加糖）": {
            "卡路里": 46.0,
            "蛋白质": 0.58,
            "碳水化合物": 11.13,
            "脂肪": 0.09
        },
        "苹果汁（婴儿食品）": {
            "卡路里": 47.0,
            "蛋白质": 0,
            "碳水化合物": 11.7,
            "脂肪": 0.1
        },
        "可可粉（用水制备）": {
            "卡路里": 55.0,
            "蛋白质": 0.92,
            "碳水化合物": 11.54,
            "脂肪": 0.55
        },
        "菠萝汁": {
            "卡路里": 53.0,
            "蛋白质": 0.36,
            "碳水化合物": 12.87,
            "脂肪": 0.12
        },
        "咖啡（酿造、用水制备）": {
            "卡路里": 1.0,
            "蛋白质": 0.12,
            "碳水化合物": 0,
            "脂肪": 0.02
        },
        "茶（黑色）": {
            "卡路里": 1.0,
            "蛋白质": 0,
            "碳水化合物": 0.3,
            "脂肪": 0
        },
        "橙汁（冷冻浓缩物）": {
            "卡路里": 37.0,
            "蛋白质": 0.6,
            "碳水化合物": 8.8,
            "脂肪": 0.06
        },
        "橘汁": {
            "卡路里": 43.0,
            "蛋白质": 0.5,
            "碳水化合物": 10.1,
            "脂肪": 0.2
        },
        "石榴汁": {
            "卡路里": 54.0,
            "蛋白质": 0.15,
            "碳水化合物": 13.13,
            "脂肪": 0.29
        },
        "酸橙汁": {
            "卡路里": 25.0,
            "蛋白质": 0.42,
            "碳水化合物": 8.42,
            "脂肪": 0.07
        },
        "葡萄汁": {
            "卡路里": 60.0,
            "蛋白质": 0.37,
            "碳水化合物": 14.77,
            "脂肪": 0.13
        },
        "橙汁（冷冻、含浓缩物）": {
            "卡路里": 49.0,
            "蛋白质": 0.68,
            "碳水化合物": 11.54,
            "脂肪": 0.12
        },
        "茶（速溶、用水制备）": {
            "卡路里": 1.0,
            "蛋白质": 0.06,
            "碳水化合物": 0.17,
            "脂肪": 0
        },
        "葡萄柚汁（粉红色）": {
            "卡路里": 39.0,
            "蛋白质": 0.5,
            "碳水化合物": 9.2,
            "脂肪": 0.1
        },
        "葡萄柚汁（白色）": {
            "卡路里": 41.0,
            "蛋白质": 0.55,
            "碳水化合物": 9.73,
            "脂肪": 0.13
        },
        "浓缩柠檬汁（罐装）": {
            "卡路里": 17.0,
            "蛋白质": 0.45,
            "碳水化合物": 5.62,
            "脂肪": 0.07
        },
        "橙汁": {
            "卡路里": 45.0,
            "蛋白质": 0.7,
            "碳水化合物": 10.4,
            "脂肪": 0.2
        },
        "醪糟": {
            "卡路里": 100.0,
            "蛋白质": 2.6,
            "碳水化合物": 22.4,
            "脂肪": 0.2
        },
        "柠檬汁": {
            "卡路里": 22.0,
            "蛋白质": 0.35,
            "碳水化合物": 6.9,
            "脂肪": 0.24
        },
        "杏仁露": {
            "卡路里": 46.0,
            "蛋白质": 0.9,
            "碳水化合物": 8.1,
            "脂肪": 1.1
        },
        "乌梅汁": {
            "卡路里": 133.0,
            "蛋白质": 0.2,
            "碳水化合物": 32.8,
            "脂肪": 0.1
        },
        "沙棘果汁": {
            "卡路里": 47.0,
            "蛋白质": 0.9,
            "碳水化合物": 10.6,
            "脂肪": 0.5
        },
        "原汁沙棘": {
            "卡路里": 48.0,
            "蛋白质": 2.6,
            "碳水化合物": 9.3,
            "脂肪": 0
        },
        "果味奶": {
            "卡路里": 20.0,
            "蛋白质": 0.9,
            "碳水化合物": 2.4,
            "脂肪": 0.8
        },
        "喜乐": {
            "卡路里": 53.0,
            "蛋白质": 0.9,
            "碳水化合物": 11.8,
            "脂肪": 0.2
        },
        "松饼": {
            "卡路里": 335.0,
            "蛋白质": 7.3,
            "碳水化合物": 48.4,
            "脂肪": 12.1
        },
        "可口可乐": {
            "卡路里": 43.0,
            "蛋白质": 0.1,
            "碳水化合物": 10.8,
            "脂肪": 0.05
        },
        "麦乳精": {
            "卡路里": 429.0,
            "蛋白质": 8.5,
            "碳水化合物": 77.0,
            "脂肪": 9.7
        },
        "士力架": {
            "卡路里": 491.0,
            "蛋白质": 7.53,
            "碳水化合物": 61.51,
            "脂肪": 23.85
        },
        "酸梅晶": {
            "卡路里": 394.0,
            "蛋白质": 0.2,
            "碳水化合物": 98.4,
            "脂肪": 0
        },
        "潜艇三明治": {
            "卡路里": 213.0,
            "蛋白质": 10.52,
            "碳水化合物": 20.43,
            "脂肪": 10.04
        },
        "燕麦棒": {
            "卡路里": 471.0,
            "蛋白质": 10.1,
            "碳水化合物": 64.4,
            "脂肪": 19.8
        },
        "FritoLay（杂粮小吃）": {
            "卡路里": 491.0,
            "蛋白质": 7.95,
            "碳水化合物": 67.26,
            "脂肪": 21.11
        },
        "能量棒（巧克力）": {
            "卡路里": 363.0,
            "蛋白质": 14.15,
            "碳水化合物": 69.63,
            "脂肪": 3.11
        },
        "比萨（意大利辣味香肠打顶、冷冻、熟）": {
            "卡路里": 274.0,
            "蛋白质": 14.38,
            "碳水化合物": 24.69,
            "脂肪": 13.13
        },
        "杂粮饼干": {
            "卡路里": 263.0,
            "蛋白质": 6.1,
            "碳水化合物": 47.4,
            "脂肪": 5.6
        },
        "松饼（冷冻、烘焙）": {
            "卡路里": 338.0,
            "蛋白质": 6.2,
            "碳水化合物": 53.87,
            "脂肪": 11.03
        },
        "橘子汁": {
            "卡路里": 119.0,
            "蛋白质": 0.2,
            "碳水化合物": 29.6,
            "脂肪": 0.1
        },
        "甜甜圈（糖化或釉面）": {
            "卡路里": 426.0,
            "蛋白质": 5.2,
            "碳水化合物": 50.8,
            "脂肪": 22.9
        },
        "海绵蛋糕": {
            "卡路里": 290.0,
            "蛋白质": 5.4,
            "碳水化合物": 61.0,
            "脂肪": 2.7
        },
        "美式香蕉面包": {
            "卡路里": 326.0,
            "蛋白质": 4.3,
            "碳水化合物": 54.6,
            "脂肪": 10.5
        },
        "甜甜圈（釉面、强化）": {
            "卡路里": 421.0,
            "蛋白质": 6.14,
            "碳水化合物": 47.93,
            "脂肪": 22.7
        },
        "甜甜圈（巧克力涂层）": {
            "卡路里": 452.0,
            "蛋白质": 4.93,
            "碳水化合物": 51.33,
            "脂肪": 25.25
        },
        "甜甜圈": {
            "卡路里": 434.0,
            "蛋白质": 5.31,
            "碳水化合物": 47.06,
            "脂肪": 24.93
        },
        "薄脆饼干（黑麦）": {
            "卡路里": 366.0,
            "蛋白质": 7.9,
            "碳水化合物": 82.2,
            "脂肪": 1.3
        },
        "甘蔗汁": {
            "卡路里": 65.0,
            "蛋白质": 0.4,
            "碳水化合物": 16.0,
            "脂肪": 0.1
        },
        "犹太逾越节薄饼": {
            "卡路里": 395.0,
            "蛋白质": 10.0,
            "碳水化合物": 83.7,
            "脂肪": 1.4
        },
        "甜面包卷（肉桂、葡萄干）": {
            "卡路里": 372.0,
            "蛋白质": 6.2,
            "碳水化合物": 50.9,
            "脂肪": 16.4
        },
        "面包（加馅、干混）": {
            "卡路里": 386.0,
            "蛋白质": 11.0,
            "碳水化合物": 76.2,
            "脂肪": 3.4
        },
        "苹果和蓝莓（初级）": {
            "卡路里": 62.0,
            "蛋白质": 0.2,
            "碳水化合物": 16.6,
            "脂肪": 0.2
        },
        "奶油夹心巧克力（糖霜）": {
            "卡路里": 399.0,
            "蛋白质": 3.63,
            "碳水化合物": 60.31,
            "脂肪": 15.93
        },
        "甜巧克力": {
            "卡路里": 507.0,
            "蛋白质": 3.9,
            "碳水化合物": 60.4,
            "脂肪": 34.2
        },
        "巧克力（黑色）": {
            "卡路里": 550.0,
            "蛋白质": 5.09,
            "碳水化合物": 59.97,
            "脂肪": 32.2
        },
        "杏脯": {
            "卡路里": 242.0,
            "蛋白质": 0.7,
            "碳水化合物": 64.4,
            "脂肪": 0.2
        },
        "水果冰淇淋（初级）": {
            "卡路里": 69.0,
            "蛋白质": 0.4,
            "碳水化合物": 16.0,
            "脂肪": 0.4
        },
        "海棠脯": {
            "卡路里": 290.0,
            "蛋白质": 0.6,
            "碳水化合物": 72.6,
            "脂肪": 0.2
        },
        "樱桃香草布丁（初级）": {
            "卡路里": 69.0,
            "蛋白质": 0.2,
            "碳水化合物": 18.4,
            "脂肪": 0.2
        },
        "月饼（豆沙）": {
            "卡路里": 411.0,
            "蛋白质": 8.2,
            "碳水化合物": 65.6,
            "脂肪": 13.6
        },
        "李广杏脯": {
            "卡路里": 293.0,
            "蛋白质": 2.8,
            "碳水化合物": 72.1,
            "脂肪": 0.3
        },
        "巧克力": {
            "卡路里": 589.0,
            "蛋白质": 4.3,
            "碳水化合物": 53.4,
            "脂肪": 40.1
        },
        "糌粑": {
            "卡路里": 261.0,
            "蛋白质": 4.1,
            "碳水化合物": 32.5,
            "脂肪": 13.1
        },
        "白砂糖": {
            "卡路里": 400.0,
            "蛋白质": 0,
            "碳水化合物": 99.98,
            "脂肪": 0
        },
        "苹果脯": {
            "卡路里": 340.0,
            "蛋白质": 0.6,
            "碳水化合物": 84.9,
            "脂肪": 0.1
        },
        "山楂球（果丹皮）": {
            "卡路里": 371.0,
            "蛋白质": 0.5,
            "碳水化合物": 92.6,
            "脂肪": 0
        },
        "红糖": {
            "卡路里": 389.0,
            "蛋白质": 0.7,
            "碳水化合物": 96.6,
            "脂肪": 0
        },
        "冰糖": {
            "卡路里": 397.0,
            "蛋白质": 0,
            "碳水化合物": 0,
            "脂肪": 0
        },
        "奶糖": {
            "卡路里": 407.0,
            "蛋白质": 2.5,
            "碳水化合物": 84.5,
            "脂肪": 6.6
        },
        "雪糕（冰棍）": {
            "卡路里": 47.0,
            "蛋白质": 0.8,
            "碳水化合物": 10.5,
            "脂肪": 0.2
        },
        "薯片": {
            "卡路里": 615.0,
            "蛋白质": 4.0,
            "碳水化合物": 41.9,
            "脂肪": 48.4
        },
        "奶油饼干": {
            "卡路里": 431.0,
            "蛋白质": 8.5,
            "碳水化合物": 70.2,
            "脂肪": 13.1
        },
        "菠萝豆": {
            "卡路里": 392.0,
            "蛋白质": 10.4,
            "碳水化合物": 82.9,
            "脂肪": 2.1
        },
        "牛奶巧克力": {
            "卡路里": 535.0,
            "蛋白质": 7.65,
            "碳水化合物": 59.4,
            "脂肪": 29.66
        },
        "钙奶饼干": {
            "卡路里": 446.0,
            "蛋白质": 8.4,
            "碳水化合物": 73.9,
            "脂肪": 13.2
        },
        "冰激凌（冰淇淋）": {
            "卡路里": 127.0,
            "蛋白质": 2.4,
            "碳水化合物": 17.3,
            "脂肪": 5.3
        },
        "饼干": {
            "卡路里": 435.0,
            "蛋白质": 9.0,
            "碳水化合物": 71.7,
            "脂肪": 12.7
        },
        "花生牛轧糖": {
            "卡路里": 432.0,
            "蛋白质": 4.9,
            "碳水化合物": 75.4,
            "脂肪": 12.3
        },
        "桃脯": {
            "卡路里": 315.0,
            "蛋白质": 1.4,
            "碳水化合物": 77.6,
            "脂肪": 0.4
        },
        "苏打饼干": {
            "卡路里": 408.0,
            "蛋白质": 8.4,
            "碳水化合物": 76.2,
            "脂肪": 7.7
        },
        "面包": {
            "卡路里": 313.0,
            "蛋白质": 8.3,
            "碳水化合物": 58.6,
            "脂肪": 5.1
        },
        "绿豆糕": {
            "卡路里": 351.0,
            "蛋白质": 12.8,
            "碳水化合物": 73.4,
            "脂肪": 1.0
        },
        "方便面": {
            "卡路里": 473.0,
            "蛋白质": 9.5,
            "碳水化合物": 61.6,
            "脂肪": 21.1
        },
        "桃酥": {
            "卡路里": 483.0,
            "蛋白质": 7.1,
            "碳水化合物": 65.1,
            "脂肪": 21.8
        },
        "燕麦片": {
            "卡路里": 377.0,
            "蛋白质": 15.0,
            "碳水化合物": 66.9,
            "脂肪": 6.7
        },
        "蛋黄酥": {
            "卡路里": 388.0,
            "蛋白质": 11.7,
            "碳水化合物": 76.9,
            "脂肪": 3.9
        },
        "江米条": {
            "卡路里": 440.0,
            "蛋白质": 5.7,
            "碳水化合物": 78.1,
            "脂肪": 11.7
        },
        "年糕": {
            "卡路里": 156.0,
            "蛋白质": 3.3,
            "碳水化合物": 34.7,
            "脂肪": 0.6
        },
        "月饼（枣泥）": {
            "卡路里": 427.0,
            "蛋白质": 7.1,
            "碳水化合物": 64.9,
            "脂肪": 15.7
        },
        "炸糕": {
            "卡路里": 282.0,
            "蛋白质": 6.1,
            "碳水化合物": 37.3,
            "脂肪": 12.3
        },
        "奶油蛋糕": {
            "卡路里": 379.0,
            "蛋白质": 7.2,
            "碳水化合物": 56.5,
            "脂肪": 13.9
        },
        "蛋糕（均值）": {
            "卡路里": 348.0,
            "蛋白质": 8.6,
            "碳水化合物": 67.1,
            "脂肪": 5.1
        },
        "青稞炒面": {
            "卡路里": 366.0,
            "蛋白质": 11.8,
            "碳水化合物": 77.0,
            "脂肪": 2.2
        },
        "月饼（五仁）": {
            "卡路里": 424.0,
            "蛋白质": 8.0,
            "碳水化合物": 64.0,
            "脂肪": 16.0
        },
        "月饼": {
            "卡路里": 435.0,
            "蛋白质": 5.1,
            "碳水化合物": 55.3,
            "脂肪": 22.1
        },
        "香油炒面": {
            "卡路里": 410.0,
            "蛋白质": 12.4,
            "碳水化合物": 80.1,
            "脂肪": 4.8
        },
        "煎饼": {
            "卡路里": 354.0,
            "蛋白质": 7.6,
            "碳水化合物": 83.8,
            "脂肪": 0.7
        },
        "米花糖": {
            "卡路里": 385.0,
            "蛋白质": 3.1,
            "碳水化合物": 85.8,
            "脂肪": 3.3
        },
        "蜜三刀": {
            "卡路里": 427.0,
            "蛋白质": 4.4,
            "碳水化合物": 70.7,
            "脂肪": 14.2
        },
        "麻花": {
            "卡路里": 527.0,
            "蛋白质": 8.3,
            "碳水化合物": 53.4,
            "脂肪": 31.5
        }
    },
    "其它": {
        "苋菜": {
            "卡路里": 371.0,
            "蛋白质": 13.56,
            "碳水化合物": 65.25,
            "脂肪": 7.02
        },
        "海带（浸）": {
            "卡路里": 16.0,
            "蛋白质": 1.1,
            "碳水化合物": 3.0,
            "脂肪": 0.1
        },
        "苔菜（苔条）": {
            "卡路里": 167.0,
            "蛋白质": 19.0,
            "碳水化合物": 26.3,
            "脂肪": 0.4
        },
        "发菜": {
            "卡路里": 259.0,
            "蛋白质": 20.2,
            "碳水化合物": 60.8,
            "脂肪": 0.5
        },
        "海带（干）": {
            "卡路里": 90.0,
            "蛋白质": 1.8,
            "碳水化合物": 23.4,
            "脂肪": 0.1
        },
        "石花菜（冻菜）": {
            "卡路里": 314.0,
            "蛋白质": 5.4,
            "碳水化合物": 72.9,
            "脂肪": 0.1
        },
        "海带": {
            "卡路里": 13.0,
            "蛋白质": 1.2,
            "碳水化合物": 2.1,
            "脂肪": 0.1
        },
        "紫菜": {
            "卡路里": 250.0,
            "蛋白质": 26.7,
            "碳水化合物": 44.1,
            "脂肪": 1.1
        },
        "树莓（冷冻、加糖）": {
            "卡路里": 103.0,
            "蛋白质": 0.7,
            "碳水化合物": 26.16,
            "脂肪": 0.16
        },
        "树莓（冷冻）": {
            "卡路里": 56.0,
            "蛋白质": 1.15,
            "碳水化合物": 12.55,
            "脂肪": 0.81
        },
        "史密斯奶奶苹果": {
            "卡路里": 58.0,
            "蛋白质": 0.44,
            "碳水化合物": 13.61,
            "脂肪": 0.19
        }
    }
};

// Helper function to get category names
export const getFoodCategories = (): string[] => {
  return Object.keys(foodData);
};

// Helper function to get items in a category, optionally filtered by search term
export const getFoodItems = (category: string, searchTerm: string = ''): Array<{ name: string; details: FoodDetails }> => {
  const categoryData = foodData[category];
  if (!categoryData) return [];

  const items = Object.entries(categoryData).map(([name, details]) => ({ name, details }));

  if (!searchTerm) return items;

  return items.filter(item => item.name.toLowerCase().includes(searchTerm.toLowerCase()));
}; 